# coding:utf8
from django.shortcuts import render
from django.http import HttpResponse

import json
# Create your views here.
def home(request):
	city_data = { 
		"city":{
			"泰安": {
			  "泰山区": [
				"不限"
			  ],
			  "岱岳区": [
				"不限"
			  ],
			  "不限": "",
			  "肥城市": [
				"不限"
			  ]
			},
			"河源": {
			  "源城区": [
				"不限"
			  ],
			  "不限": ""
			},
			"三明": {
			  "不限": "",
			  "梅列区": [
				"不限"
			  ]
			},
			"淮南": {
			  "大通区": [
				"不限"
			  ],
			  "不限": "",
			  "潘集区": [
				"不限"
			  ]
			},
			"镇江": {
			  "丹阳市": [
				"不限"
			  ],
			  "不限": "",
			  "京口区": [
				"不限"
			  ],
			  "润州区": [
				"不限"
			  ],
			  "句容市": [
				"不限"
			  ]
			},
			"滨州": {
			  "不限": "",
			  "滨城区": [
				"不限"
			  ]
			},
			"抚州": {
			  "不限": "",
			  "临川区": [
				"不限"
			  ]
			},
			"成都": {
			  "成华区": [
				"不限",
				"建设路",
				"府青路",
				"圣灯",
				"保和",
				"桃蹊路",
				"二仙桥",
				"八里小区",
				"万年场",
				"双桥子",
				"双林路",
				"猛追湾",
				"青龙",
				"双水碾",
				"驷马桥",
				"跳蹬河",
				"龙潭",
				"八里庄",
				"新华公园",
				"新鸿路"
			  ],
			  "金牛区": [
				"不限",
				"金泉",
				"沙湾",
				"西南交大",
				"茶店子",
				"九里堤",
				"沙河源",
				"蜀汉路",
				"营门口",
				"黄忠",
				"交大路",
				"抚琴",
				"凤凰山",
				"荷花池",
				"梁家巷",
				"李家沱",
				"人民北路",
				"抚琴小区",
				"会展中心",
				"城隍庙",
				"五块石"
			  ],
			  "蒲江县": [
				"不限"
			  ],
			  "高新区": [
				"不限",
				"神仙树",
				"紫荆",
				"创业路",
				"芳草街"
			  ],
			  "不限": "",
			  "都江堰市": [
				"不限",
				"幸福"
			  ],
			  "新都区": [
				"不限",
				"斑竹园",
				"三河",
				"新都"
			  ],
			  "郫县": [
				"不限",
				"犀浦",
				"友爱",
				"红光",
				"德源"
			  ],
			  "双流县": [
				"不限",
				"华阳",
				"白家",
				"九江",
				"公兴",
				"正兴",
				"顺城街",
				"东升",
				"文星"
			  ],
			  "青白江区": [
				"不限"
			  ],
			  "双流区": [
				"不限"
			  ],
			  "青羊区": [
				"不限",
				"骡马市",
				"太升路",
				"黄田坝",
				"草市街",
				"苏坡",
				"府南",
				"八宝街",
				"草堂",
				"青羊宫",
				"杜甫草堂",
				"人民公园",
				"金沙",
				"新华西路",
				"少城",
				"光华",
				"青羊大道",
				"天府广场",
				"文家",
				"东坡",
				"贝森",
				"西南财大",
				"汪家拐",
				"西华门"
			  ],
			  "龙泉驿": [
				"不限"
			  ],
			  "崇州市": [
				"不限",
				"崇阳"
			  ],
			  "温江区": [
				"不限",
				"涌泉",
				"金马",
				"柳城",
				"天府",
				"公平"
			  ],
			  "龙泉驿区": [
				"不限"
			  ],
			  "锦江区": [
				"不限",
				"东门大桥",
				"牛王庙",
				"合江亭",
				"春熙路",
				"柳江",
				"红星路",
				"牛市口",
				"盐市口",
				"成龙路",
				"书院街",
				"督院街",
				"四川师大",
				"东光",
				"海椒市",
				"九眼桥",
				"莲新",
				"沙河",
				"四川大学",
				"三圣",
				"狮子山",
				"双桂路"
			  ],
			  "邛崃市": [
				"不限",
				"平乐"
			  ],
			  "武侯区": [
				"不限",
				"跳伞塔",
				"四川大学",
				"桐梓林",
				"火车南站",
				"科华北路",
				"桂溪",
				"金花桥",
				"机投桥",
				"双楠",
				"高升桥",
				"玉林",
				"石羊",
				"红牌楼",
				"中华园",
				"磨子桥",
				"武侯祠",
				"小天竺",
				"簇桥",
				"浆洗街",
				"紫荆",
				"肖家河",
				"望江路",
				"燃灯寺",
				"小天北街",
				"神仙树",
				"芳草街"
			  ]
			},
			"太原": {
			  "小店区": [
				"不限",
				"高新科技产业区",
				"长风街",
				"坞城",
				"亲贤北街",
				"黄陵",
				"北营",
				"杨家堡"
			  ],
			  "晋源区": [
				"不限"
			  ],
			  "万柏林区": [
				"不限",
				"千峰",
				"和平",
				"下元",
				"漪汾街",
				"义井"
			  ],
			  "不限": "",
			  "杏花岭区": [
				"不限",
				"巨轮",
				"三桥",
				"鼓楼",
				"坝陵桥"
			  ],
			  "迎泽区": [
				"不限",
				"桥东",
				"柳巷",
				"双塔西街",
				"文庙",
				"并州北路",
				"老军营"
			  ]
			},
			"漳州": {
			  "龙文区": [
				"不限"
			  ],
			  "不限": "",
			  "平和县": [
				"不限"
			  ],
			  "诏安县": [
				"不限"
			  ],
			  "芗城区": [
				"不限"
			  ]
			},
			"池州": {
			  "石台县": [
				"不限"
			  ],
			  "不限": ""
			},
			"百色": {
			  "田阳县": [
				"不限"
			  ],
			  "不限": "",
			  "右江区": [
				"不限"
			  ]
			},
			"恩施": {
			  "潜江市": [
				"不限"
			  ],
			  "不限": ""
			},
			"莆田": {
			  "不限": "",
			  "城厢区": [
				"不限"
			  ]
			},
			"大连": {
			  "开发区": [
				"不限"
			  ],
			  "沙河口区": [
				"不限",
				"星海湾",
				"交大",
				"黑石礁",
				"滨海路",
				"辽宁师范大学",
				"西山",
				"黄河路",
				"数码路",
				"星海公园",
				"星海广场",
				"西安路",
				"太原街",
				"尖山街",
				"妇产医院",
				"连山街",
				"白山路",
				"民权",
				"台山",
				"和平广场",
				"东北路",
				"富国街",
				"解放广场",
				"莲花山",
				"万岁街"
			  ],
			  "甘井子区": [
				"不限",
				"广贤路",
				"火炬路",
				"七贤岭",
				"东软",
				"理工大学",
				"小辛寨子",
				"张前路",
				"黄浦路",
				"华南",
				"海事大学",
				"山东路",
				"机场",
				"周水子",
				"椒金山",
				"华南中学",
				"中华路",
				"红凌路"
			  ],
			  "金州区": [
				"不限"
			  ],
			  "长兴岛": [
				"不限"
			  ],
			  "旅顺口区": [
				"不限",
				"黄泥川",
				"老铁山",
				"铁山"
			  ],
			  "中山区": [
				"不限",
				"天津街",
				"港湾广场",
				"人民路",
				"丹东街",
				"港湾街",
				"长江路",
				"青泥洼桥",
				"民主广场",
				"三八广场",
				"胜利广场",
				"友谊商城",
				"老虎滩",
				"昆明街",
				"希望广场",
				"延安路",
				"解放路",
				"二七广场",
				"迎宾路",
				"中南路",
				"民生街"
			  ],
			  "西岗区": [
				"不限",
				"工人村",
				"金海花园",
				"香炉礁",
				"长江路",
				"人民广场",
				"新开路",
				"奥林匹克广场",
				"白云新村",
				"站北",
				"胜利路",
				"纪念街"
			  ],
			  "不限": "",
			  "高新园区": [
				"不限",
				"七贤岭",
				"庙岭",
				"海事大学",
				"理工大学",
				"软件园",
				"黄泥川",
				"凌水",
				"东软",
				"小平岛",
				"数码广场"
			  ]
			},
			"马鞍山": {
			  "花山区": [
				"不限"
			  ],
			  "不限": "",
			  "雨山区": [
				"不限"
			  ]
			},
			"杭州": {
			  "滨江区": [
				"不限",
				"长河",
				"江南",
				"西兴",
				"浦沿"
			  ],
			  "上城区": [
				"不限",
				"近江",
				"望江",
				"紫阳",
				"南星",
				"复兴路",
				"西湖大道",
				"吴山广场",
				"河坊街",
				"小营",
				"湖滨",
				"江城路",
				"南山路",
				"城站火车站",
				"万松岭",
				"清泰街",
				"平海路",
				"解放路",
				"清波"
			  ],
			  "余杭区": [
				"不限",
				"仓前",
				"临平",
				"东湖",
				"南苑",
				"运河",
				"勾庄",
				"闲林",
				"良渚",
				"崇贤",
				"星桥",
				"天都城",
				"乔司",
				"金家渡"
			  ],
			  "下沙": [
				"不限"
			  ],
			  "淳安县": [
				"不限",
				"千岛湖"
			  ],
			  "富阳区": [
				"不限"
			  ],
			  "临安市": [
				"不限",
				"玲珑"
			  ],
			  "不限": "",
			  "萧山区": [
				"不限",
				"市心北路",
				"建设二路",
				"建设三路",
				"萧金路",
				"湘湖路",
				"建设一路",
				"宁围",
				"文明路",
				"工人路",
				"闻堰",
				"金城路",
				"金鸡路",
				"北干",
				"坎山",
				"衙前",
				"金惠路",
				"城厢",
				"市心南路",
				"宁东路",
				"高桥",
				"山阴",
				"通惠北路"
			  ],
			  "江干区": [
				"不限",
				"四季青",
				"高教园",
				"下沙",
				"白杨",
				"景芳",
				"凯旋",
				"火车东站",
				"秋涛北路",
				"采荷",
				"闸弄口",
				"华家池",
				"笕桥"
			  ],
			  "富阳市": [
				"不限",
				"鹿山"
			  ],
			  "下城区": [
				"不限",
				"朝晖",
				"天水",
				"东新路",
				"武林广场",
				"建国路",
				"凤起路",
				"环城西路",
				"庆春路",
				"长庆",
				"潮鸣",
				"艮山"
			  ],
			  "拱墅区": [
				"不限",
				"小河",
				"湖墅南路",
				"上塘",
				"和睦",
				"拱宸桥",
				"余杭塘上",
				"康桥",
				"米市巷",
				"大关",
				"德胜",
				"半山"
			  ],
			  "西湖区": [
				"不限",
				"古墩路",
				"西湖",
				"高新文教区",
				"古荡",
				"西溪",
				"文一路",
				"文三路",
				"翠苑",
				"天目山路",
				"文新",
				"黄龙",
				"文二路",
				"桂花园",
				"三墩",
				"西湖北线",
				"曙光路",
				"龙井",
				"虎跑",
				"灵隐"
			  ]
			},
			"莱芜": {
			  "不限": "",
			  "莱城区": [
				"不限"
			  ]
			},
			"延边": {
			  "延吉市": [
				"不限"
			  ],
			  "不限": "",
			  "敦化市": [
				"不限"
			  ]
			},
			"和田": {
			  "和田市": [
				"不限"
			  ],
			  "不限": ""
			},
			"贵阳": {
			  "乌当区": [
				"不限"
			  ],
			  "云岩区": [
				"不限",
				"沙河",
				"大营坡",
				"盐务街",
				"贵乌路",
				"宅吉",
				"大西门",
				"喷水池",
				"黔灵东路",
				"中山西路",
				"北京路",
				"延安中路",
				"中华北路",
				"师大",
				"八鸽岩",
				"宝山北路"
			  ],
			  "白云区": [
				"不限"
			  ],
			  "花溪区": [
				"不限",
				"中曹",
				"漓江路"
			  ],
			  "观山湖区": [
				"不限"
			  ],
			  "不限": "",
			  "观山湖区（金阳新区）": [
				"不限"
			  ],
			  "南明区": [
				"不限",
				"太慈桥",
				"花果园",
				"大南门",
				"富水南路",
				"护国路",
				"兴关",
				"新华路",
				"中华南路",
				"遵义路",
				"解放路"
			  ]
			},
			"株洲": {
			  "茶陵县": [
				"不限"
			  ],
			  "不限": "",
			  "荷塘区": [
				"不限"
			  ],
			  "天元区": [
				"不限"
			  ]
			},
			"滁州": {
			  "不限": "",
			  "琅琊区": [
				"不限"
			  ],
			  "南谯区": [
				"不限"
			  ]
			},
			"东营": {
			  "不限": "",
			  "东营区": [
				"不限"
			  ]
			},
			"赣州": {
			  "章贡区": [
				"不限"
			  ],
			  "不限": "",
			  "南康区": [
				"不限"
			  ]
			},
			"三亚": {
			  "吉阳区": [
				"不限"
			  ],
			  "不限": "",
			  "市辖区": [
				"不限"
			  ]
			},
			"自贡": {
			  "不限": "",
			  "自流井区": [
				"不限"
			  ],
			  "贡井区": [
				"不限"
			  ],
			  "富顺县": [
				"不限"
			  ]
			},
			"拉萨": {
			  "不限": "",
			  "堆龙德庆区": [
				"不限"
			  ],
			  "城关区": [
				"不限"
			  ]
			},
			"乌兰察布": {
			  "集宁区": [
				"不限"
			  ],
			  "不限": ""
			},
			"晋城": {
			  "不限": "",
			  "城区": [
				"不限"
			  ]
			},
			"保定": {
			  "莲池区": [
				"不限"
			  ],
			  "涿州市": [
				"不限"
			  ],
			  "徐水县": [
				"不限"
			  ],
			  "新市区": [
				"不限"
			  ],
			  "竞秀区": [
				"不限"
			  ],
			  "北市区": [
				"不限"
			  ],
			  "不限": "",
			  "定兴县": [
				"不限"
			  ],
			  "徐水区": [
				"不限"
			  ],
			  "南市区": [
				"不限"
			  ],
			  "安国市": [
				"不限"
			  ]
			},
			"宿迁": {
			  "不限": "",
			  "宿豫区": [
				"不限"
			  ]
			},
			"锦州": {
			  "太和区": [
				"不限"
			  ],
			  "不限": ""
			},
			"襄阳": {
			  "不限": "",
			  "樊城区": [
				"不限"
			  ],
			  "襄城区": [
				"不限"
			  ]
			},
			"郑州": {
			  "航空港区": [
				"不限"
			  ],
			  "中原区": [
				"不限",
				"冉屯路",
				"建设路",
				"绿东村",
				"秦岭路",
				"市场街",
				"桐柏路",
				"华山路",
				"碧沙岗",
				"湖光苑",
				"棉纺路"
			  ],
			  "高新区": [
				"不限"
			  ],
			  "新郑市": [
				"不限"
			  ],
			  "经开区": [
				"不限"
			  ],
			  "郑东新区": [
				"不限"
			  ],
			  "管城区": [
				"不限",
				"南关",
				"二里岗",
				"城东路",
				"商城路"
			  ],
			  "惠济区": [
				"不限",
				"老鸦陈",
				"迎宾路",
				"长兴路",
				"省体育中心"
			  ],
			  "新密市": [
				"不限"
			  ],
			  "不限": "",
			  "金水区": [
				"不限",
				"农业路沿线",
				"省政府",
				"东风路",
				"丰产路",
				"森林公园",
				"未来路",
				"北林路",
				"财经学院",
				"燕庄",
				"郑汴路",
				"花园路",
				"徐寨路",
				"北环路",
				"祭城",
				"民航路",
				"金水路",
				"丰庆路",
				"胜岗",
				"文化路",
				"姚寨",
				"国基路",
				"东建材",
				"纬二路",
				"俭学街",
				"凤凰台",
				"经八路",
				"南阳路",
				"省体育馆",
				"政四街",
				"新柳路",
				"索凌路",
				"宋寨",
				"杜岭",
				"大石桥",
				"经二路",
				"东里路",
				"经五路",
				"铭功路",
				"中方园",
				"经六路",
				"农业路",
				"人民路",
				"黄河路"
			  ],
			  "管城回族区": [
				"不限"
			  ],
			  "中牟县": [
				"不限"
			  ],
			  "二七区": [
				"不限",
				"大学路",
				"京广路",
				"郑州铁路局",
				"火车站",
				"航海中路",
				"淮河路",
				"庆丰街",
				"洁云路",
				"齐礼阎",
				"铭功路",
				"建设东路",
				"交通路",
				"人民公园",
				"中原东路",
				"绿城广场",
				"一马路",
				"建新街",
				"郑密路",
				"福华街"
			  ]
			},
			"邢台": {
			  "不限": "",
			  "桥东区": [
				"不限"
			  ]
			},
			"大同": {
			  "不限": "",
			  "城区": [
				"不限"
			  ]
			},
			"澳门特别行政区": {
			  "澳门半岛": [
				"不限"
			  ],
			  "不限": ""
			},
			"濮阳": {
			  "华龙区": [
				"不限"
			  ],
			  "不限": ""
			},
			"肇庆": {
			  "不限": "",
			  "四会市": [
				"不限"
			  ],
			  "端州区": [
				"不限"
			  ]
			},
			"济宁": {
			  "兖州区": [
				"不限"
			  ],
			  "任城区": [
				"不限"
			  ],
			  "邹城市": [
				"不限"
			  ],
			  "曲阜市": [
				"不限"
			  ],
			  "不限": "",
			  "市中区": [
				"不限"
			  ]
			},
			"抚顺": {
			  "望花区": [
				"不限"
			  ],
			  "不限": ""
			},
			"包头": {
			  "不限": "",
			  "九原区": [
				"不限"
			  ],
			  "青山区": [
				"不限"
			  ]
			},
			"乐山": {
			  "不限": "",
			  "市中区": [
				"不限"
			  ]
			},
			"绍兴": {
			  "越城区": [
				"不限"
			  ],
			  "嵊州市": [
				"不限"
			  ],
			  "柯桥区": [
				"不限"
			  ],
			  "诸暨市": [
				"不限"
			  ],
			  "绍兴县": [
				"不限"
			  ],
			  "不限": "",
			  "上虞区": [
				"不限"
			  ],
			  "新昌县": [
				"不限"
			  ]
			},
			"阳泉": {
			  "不限": "",
			  "城区": [
				"不限"
			  ]
			},
			"荆州": {
			  "荆州区": [
				"不限"
			  ],
			  "不限": ""
			},
			"巴中": {
			  "不限": "",
			  "巴州区": [
				"不限"
			  ]
			},
			"宁德": {
			  "不限": "",
			  "福安市": [
				"不限"
			  ]
			},
			"深圳": {
			  "罗湖区": [
				"不限",
				"东门",
				"蔡屋围",
				"笋岗",
				"宝安南路沿线",
				"火车站",
				"国贸",
				"泥岗",
				"莲塘",
				"翠竹",
				"布心",
				"文锦渡",
				"水贝",
				"留医部",
				"黄贝岭",
				"罗湖区委",
				"东湖",
				"人民南",
				"水库",
				"田贝",
				"独树村",
				"洪湖",
				"清水河",
				"草埔",
				"东晓",
				"金稻田",
				"银湖",
				"理想新城",
				"红岗花园"
			  ],
			  "南山区": [
				"不限",
				"科技园",
				"大冲",
				"南山医院",
				"南头",
				"深圳湾",
				"南油",
				"桂庙路口",
				"蛇口",
				"后海",
				"西丽",
				"白石洲",
				"招商大厦",
				"海王大厦",
				"华侨城",
				"海上世界",
				"桃源村",
				"南新路口",
				"前海",
				"南山区"
			  ],
			  "坪山新区": [
				"不限"
			  ],
			  "福田区": [
				"不限",
				"香蜜湖",
				"车公庙",
				"福华新村",
				"岗厦",
				"莲花北村",
				"皇岗",
				"上步",
				"华强北",
				"上梅林",
				"景田",
				"竹子林",
				"益田村",
				"笔架山",
				"保税区",
				"新洲",
				"购物公园",
				"莲花三村",
				"莲花二村",
				"下沙",
				"振华路",
				"中信广场",
				"上沙",
				"八卦岭",
				"园岭",
				"下梅林",
				"沙尾",
				"福田区委",
				"石厦",
				"沙嘴",
				"白沙岭",
				"赤尾",
				"荔枝公园",
				"黄木岗",
				"福民新村",
				"莲花一村"
			  ],
			  "宝安区": [
				"不限",
				"西乡",
				"新安",
				"翻身路",
				"桃源居",
				"沙井",
				"福永",
				"石岩",
				"松岗",
				"民治",
				"潜龙花园",
				"美丽365花园",
				"锦绣江南",
				"观澜"
			  ],
			  "大鹏新区": [
				"不限"
			  ],
			  "不限": "",
			  "龙华新区": [
				"不限"
			  ],
			  "光明新区": [
				"不限"
			  ],
			  "龙岗区": [
				"不限",
				"万科城",
				"坂田",
				"布吉",
				"横岗",
				"桂芳园",
				"康桥",
				"龙珠花园",
				"坪山",
				"理想新城",
				"坪地",
				"大芬村",
				"平湖"
			  ],
			  "盐田区": [
				"不限",
				"沙头角",
				"小梅沙",
				"大梅沙"
			  ]
			},
			"鹤壁": {
			  "不限": ""
			},
			"景德镇": {
			  "不限": "",
			  "昌江区": [
				"不限"
			  ]
			},
			"台州": {
			  "临海市": [
				"不限"
			  ],
			  "温岭市": [
				"不限"
			  ],
			  "椒江区": [
				"不限"
			  ],
			  "黄岩区": [
				"不限"
			  ],
			  "不限": "",
			  "三门县": [
				"不限"
			  ]
			},
			"潮州": {
			  "不限": "",
			  "湘桥区": [
				"不限"
			  ],
			  "潮安区": [
				"不限"
			  ]
			},
			"黔南": {
			  "不限": "",
			  "罗甸县": [
				"不限"
			  ]
			},
			"信阳": {
			  "不限": "",
			  "新县": [
				"不限"
			  ],
			  "平桥区": [
				"不限"
			  ]
			},
			"九江": {
			  "浔阳区": [
				"不限"
			  ],
			  "不限": "",
			  "庐山区": [
				"不限"
			  ],
			  "武宁县": [
				"不限"
			  ],
			  "九江县": [
				"不限"
			  ]
			},
			"秦皇岛": {
			  "不限": "",
			  "抚宁区": [
				"不限"
			  ],
			  "海港区": [
				"不限"
			  ]
			},
			"茂名": {
			  "不限": "",
			  "电白区": [
				"不限"
			  ],
			  "茂南区": [
				"不限"
			  ]
			},
			"沧州": {
			  "献县": [
				"不限"
			  ],
			  "运河区": [
				"不限"
			  ],
			  "不限": "",
			  "新华区": [
				"不限"
			  ]
			},
			"塔城": {
			  "额敏县": [
				"不限"
			  ],
			  "不限": ""
			},
			"德阳": {
			  "广汉市": [
				"不限"
			  ],
			  "不限": "",
			  "旌阳区": [
				"不限"
			  ],
			  "中江县": [
				"不限"
			  ]
			},
			"汕尾": {
			  "不限": "",
			  "城区": [
				"不限"
			  ]
			},
			"梅州": {
			  "兴宁市": [
				"不限"
			  ],
			  "不限": ""
			},
			"南通": {
			  "海安县": [
				"不限"
			  ],
			  "崇川区": [
				"不限"
			  ],
			  "如皋市": [
				"不限"
			  ],
			  "启东市": [
				"不限"
			  ],
			  "通州区": [
				"不限"
			  ],
			  "不限": "",
			  "港闸区": [
				"不限"
			  ],
			  "海门市": [
				"不限"
			  ]
			},
			"南阳": {
			  "卧龙区": [
				"不限"
			  ],
			  "不限": ""
			},
			"常州": {
			  "天宁区": [
				"不限"
			  ],
			  "武进区": [
				"不限"
			  ],
			  "金坛区": [
				"不限"
			  ],
			  "钟楼区": [
				"不限"
			  ],
			  "不限": "",
			  "新北区": [
				"不限"
			  ]
			},
			"克拉玛依": {
			  "不限": ""
			},
			"烟台": {
			  "莱山区": [
				"不限",
				"曹家",
				"清泉寨",
				"石沟屯",
				"黄海城市花园"
			  ],
			  "开发区": [
				"不限"
			  ],
			  "高新区": [
				"不限"
			  ],
			  "福山区": [
				"不限",
				"高疃"
			  ],
			  "不限": "",
			  "芝罘区": [
				"不限",
				"通伸",
				"世回尧",
				"东山",
				"白石",
				"毓璜顶",
				"奇山",
				"向阳",
				"幸福",
				"凤凰台",
				"只楚"
			  ],
			  "招远市": [
				"不限"
			  ]
			},
			"淄博": {
			  "不限": "",
			  "临淄区": [
				"不限"
			  ],
			  "张店区": [
				"不限"
			  ]
			},
			"徐州": {
			  "铜山区": [
				"不限"
			  ],
			  "睢宁县": [
				"不限"
			  ],
			  "不限": "",
			  "鼓楼区": [
				"不限"
			  ],
			  "泉山区": [
				"不限"
			  ],
			  "云龙区": [
				"不限"
			  ]
			},
			"南宁": {
			  "马山县": [
				"不限"
			  ],
			  "西乡塘区": [
				"不限"
			  ],
			  "兴宁区": [
				"不限"
			  ],
			  "邕宁区": [
				"不限"
			  ],
			  "不限": "",
			  "青秀区": [
				"不限"
			  ],
			  "良庆区": [
				"不限"
			  ],
			  "江南区": [
				"不限"
			  ]
			},
			"南平": {
			  "不限": "",
			  "顺昌县": [
				"不限"
			  ]
			},
			"鄂州": {
			  "不限": "",
			  "鄂城区": [
				"不限"
			  ]
			},
			"青岛": {
			  "崂山区": [
				"不限",
				"海尔路",
				"中韩",
				"北村",
				"同安路",
				"石老人",
				"辽阳路",
				"麦岛大学区",
				"麦岛",
				"香港东路",
				"松岭路"
			  ],
			  "城阳区": [
				"不限",
				"流亭",
				"小北曲",
				"正阳路",
				"长城路",
				"大北曲",
				"中城路",
				"杨埠寨",
				"上马",
				"夏庄"
			  ],
			  "市北区": [
				"不限",
				"延安路",
				"洪山坡",
				"延吉路",
				"合肥路",
				"大港",
				"辽宁路",
				"登州路",
				"敦化路",
				"浮山新区",
				"福州北路",
				"威海路",
				"同安路",
				"台东"
			  ],
			  "青岛高新技术产业开发区": [
				"不限"
			  ],
			  "青岛经济技术开发区": [
				"不限"
			  ],
			  "不限": "",
			  "李沧区": [
				"不限",
				"虎山路",
				"东山",
				"李村",
				"三中",
				"京口",
				"峰山",
				"重庆中路",
				"侯家庄",
				"中崂路",
				"郑庄",
				"桃园",
				"青山路",
				"书院路",
				"枣园",
				"浮山路",
				"夏庄路"
			  ],
			  "保税区": [
				"不限"
			  ],
			  "即墨市": [
				"不限",
				"龙山"
			  ],
			  "胶州市": [
				"不限"
			  ],
			  "平度市": [
				"不限"
			  ],
			  "市南区": [
				"不限",
				"浮山",
				"香港中路",
				"市政府",
				"宁夏路",
				"五四广场",
				"湛山",
				"东海路",
				"山东路",
				"金门路",
				"香港西路",
				"天山小区",
				"广电大厦",
				"福州南路",
				"燕儿岛",
				"辛家庄",
				"延安三路",
				"闽江路",
				"八大峡",
				"贵州路",
				"团岛",
				"泰州路",
				"江西路",
				"汇泉广场",
				"火车站",
				"火车站",
				"八大关",
				"珠海路",
				"栈桥",
				"中山路"
			  ],
			  "黄岛区": [
				"不限",
				"长江路",
				"薛家岛"
			  ]
			},
			"运城": {
			  "万荣县": [
				"不限"
			  ],
			  "不限": "",
			  "盐湖区": [
				"不限"
			  ]
			},
			"香港特别行政区": {
			  "沙田区": [
				"不限"
			  ],
			  "不限": "",
			  "离岛区": [
				"不限"
			  ],
			  "观塘区": [
				"不限"
			  ]
			},
			"营口": {
			  "鲅鱼圈区": [
				"不限"
			  ],
			  "不限": "",
			  "站前区": [
				"不限"
			  ]
			},
			"丽水": {
			  "不限": "",
			  "莲都区": [
				"不限"
			  ]
			},
			"天津": {
			  "北辰区": [
				"不限",
				"双口",
				"北仓"
			  ],
			  "宝坻区": [
				"不限"
			  ],
			  "红桥区": [
				"不限",
				"芥园道",
				"邵公庄",
				"丁字沽",
				"西沽街",
				"本溪路",
				"西于庄街",
				"咸阳北路街"
			  ],
			  "宁河县": [
				"不限",
				"芦台"
			  ],
			  "东丽区": [
				"不限",
				"华明",
				"津塘路",
				"利津路",
				"张贵庄街",
				"程林庄"
			  ],
			  "津南区": [
				"不限",
				"咸水沽",
				"辛庄",
				"双港"
			  ],
			  "武清区": [
				"不限",
				"东蒲洼",
				"大王古庄",
				"下朱庄"
			  ],
			  "和平区": [
				"不限",
				"和平路",
				"鞍山道沿线",
				"滨江道",
				"国际大厦",
				"西康路沿线",
				"五大道",
				"黄家花园",
				"小白楼",
				"海光寺",
				"南市",
				"劝业场街",
				"荣业大街"
			  ],
			  "滨海新区": [
				"不限",
				"塘沽城区",
				"解放路街",
				"向阳街",
				"杭州道街",
				"三槐路街"
			  ],
			  "西青区": [
				"不限",
				"华苑街",
				"侯台",
				"李七庄",
				"南河",
				"中北",
				"大寺",
				"西营门",
				"张家窝"
			  ],
			  "不限": "",
			  "南开区": [
				"不限",
				"六里台",
				"天拖地区",
				"长虹公园",
				"黄河道",
				"白堤路",
				"嘉陵道街",
				"体育中心",
				"时代奥城",
				"王顶堤",
				"水上公园",
				"南开公园",
				"兴南街",
				"密云路",
				"风荷园",
				"古文化街",
				"鼓楼",
				"学府街",
				"向阳路街"
			  ],
			  "河东区": [
				"不限",
				"大直沽",
				"大桥道",
				"大王庄",
				"工业大学",
				"中山门",
				"常州道街",
				"上杭路街",
				"春华街",
				"向阳楼街",
				"后广场",
				"万新村",
				"新开路",
				"二号桥",
				"津塘路"
			  ],
			  "静海县": [
				"不限"
			  ],
			  "河西区": [
				"不限",
				"图书大厦",
				"人民公园",
				"尖山",
				"下瓦房街",
				"围堤道沿线",
				"土城",
				"挂甲寺街",
				"永安道",
				"佟楼",
				"宾水道",
				"友谊路街",
				"体院北",
				"越秀路街",
				"梅江",
				"大营门",
				"陈塘庄街",
				"小海地",
				"气象台路"
			  ],
			  "河北区": [
				"不限",
				"狮子林大街",
				"中山路",
				"三马路"
			  ]
			},
			"泸州": {
			  "不限": "",
			  "龙马潭区": [
				"不限"
			  ]
			},
			"潍坊": {
			  "潍城区": [
				"不限"
			  ],
			  "昌邑市": [
				"不限"
			  ],
			  "不限": "",
			  "坊子区": [
				"不限"
			  ],
			  "奎文区": [
				"不限"
			  ]
			},
			"淮安": {
			  "涟水县": [
				"不限"
			  ],
			  "清河区": [
				"不限"
			  ],
			  "不限": ""
			},
			"湖州": {
			  "南浔区": [
				"不限"
			  ],
			  "安吉县": [
				"不限"
			  ],
			  "吴兴区": [
				"不限"
			  ],
			  "不限": "",
			  "长兴县": [
				"不限"
			  ],
			  "德清县": [
				"不限"
			  ]
			},
			"吉林": {
			  "不限": "",
			  "昌邑区": [
				"不限"
			  ]
			},
			"阳江": {
			  "江城区": [
				"不限"
			  ],
			  "不限": ""
			},
			"毕节": {
			  "不限": "",
			  "七星关区": [
				"不限"
			  ]
			},
			"乌鲁木齐": {
			  "沙依巴克区": [
				"不限"
			  ],
			  "米东区": [
				"不限"
			  ],
			  "天山区": [
				"不限"
			  ],
			  "头屯河区": [
				"不限"
			  ],
			  "水磨沟区": [
				"不限"
			  ],
			  "不限": "",
			  "乌鲁木齐县": [
				"不限"
			  ],
			  "新市区": [
				"不限"
			  ]
			},
			"石家庄": {
			  "东开发区": [
				"不限"
			  ],
			  "新华区": [
				"不限",
				"新华路",
				"西三庄",
				"西苑",
				"清真寺街",
				"赵陵铺"
			  ],
			  "鹿泉市": [
				"不限"
			  ],
			  "长安区": [
				"不限",
				"中山东路",
				"广安",
				"建北",
				"跃进",
				"西兆通",
				"长丰",
				"高营",
				"育才",
				"谈固",
				"河东",
				"范西路"
			  ],
			  "不限": "",
			  "裕华区": [
				"不限",
				"东苑",
				"槐北路",
				"青园",
				"煤机街",
				"裕东",
				"孙村",
				"槐底",
				"裕兴",
				"方村"
			  ],
			  "桥东区": [
				"不限",
				"胜北",
				"休门",
				"阜康",
				"建安",
				"桃园"
			  ],
			  "桥西区": [
				"不限",
				"中山",
				"振头",
				"新石",
				"友谊",
				"红旗",
				"苑东",
				"南长",
				"维明",
				"西里",
				"东里",
				"维明南大街"
			  ]
			},
			"菏泽": {
			  "不限": "",
			  "牡丹区": [
				"不限"
			  ]
			},
			"淮北": {
			  "烈山区": [
				"不限"
			  ],
			  "不限": "",
			  "濉溪县": [
				"不限"
			  ]
			},
			"蚌埠": {
			  "龙子湖区": [
				"不限"
			  ],
			  "不限": "",
			  "禹会区": [
				"不限"
			  ],
			  "淮上区": [
				"不限"
			  ]
			},
			"珠海": {
			  "金湾区": [
				"不限"
			  ],
			  "不限": "",
			  "香洲区": [
				"不限"
			  ],
			  "斗门区": [
				"不限"
			  ]
			},
			"盐城": {
			  "亭湖区": [
				"不限"
			  ],
			  "建湖县": [
				"不限"
			  ],
			  "不限": "",
			  "盐都区": [
				"不限"
			  ]
			},
			"泰州": {
			  "靖江市": [
				"不限"
			  ],
			  "海陵区": [
				"不限"
			  ],
			  "高港区": [
				"不限"
			  ],
			  "不限": "",
			  "姜堰区": [
				"不限"
			  ]
			},
			"合肥": {
			  "新站综合开发试验区": [
				"不限"
			  ],
			  "肥西县": [
				"不限"
			  ],
			  "高新区": [
				"不限"
			  ],
			  "蜀山区": [
				"不限",
				"黄山路",
				"潜山路",
				"石台路",
				"东至路",
				"望江路",
				"井岗",
				"安徽大学",
				"梦园小区",
				"科技大学",
				"环湖东路",
				"长江西路",
				"荷叶地",
				"十里庙",
				"海关路",
				"合作化北路",
				"西站",
				"安徽农业大学",
				"五里墩",
				"二环路",
				"玉兰新村",
				"岳西路"
			  ],
			  "瑶海区": [
				"不限",
				"城东",
				"胜利广场",
				"临泉路",
				"长淮",
				"大东门",
				"全椒路",
				"长江东路",
				"当涂路",
				"裕丰花市",
				"七里站",
				"车站",
				"十一中"
			  ],
			  "包河区": [
				"不限",
				"合家福购物广场",
				"二中",
				"合肥工业大学",
				"东陈岗",
				"世纪阳光花园",
				"卫岗",
				"巢湖路",
				"马鞍山路",
				"大圩",
				"九华山路",
				"东流路",
				"骆岗",
				"葛大店",
				"常青",
				"风和园",
				"太湖路"
			  ],
			  "滨湖新区": [
				"不限"
			  ],
			  "不限": "",
			  "庐江县": [
				"不限"
			  ],
			  "巢湖市": [
				"不限"
			  ],
			  "肥东县": [
				"不限"
			  ],
			  "庐阳区": [
				"不限",
				"砀山路",
				"望城店",
				"大西门",
				"濉溪路",
				"南国花园",
				"海棠",
				"长江中路",
				"百花井",
				"亳州路",
				"白水坝",
				"光明",
				"安庆路",
				"城隍庙",
				"阜南路",
				"鼓楼",
				"工大北区",
				"四里河",
				"阜阳路桥",
				"双岗",
				"蒙城路",
				"公交四公司",
				"杏花公园"
			  ],
			  "政务文化新区": [
				"不限"
			  ],
			  "经济技术开发区": [
				"不限"
			  ]
			},
			"哈尔滨": {
			  "尚志市": [
				"不限"
			  ],
			  "双城市": [
				"不限"
			  ],
			  "道里区": [
				"不限",
				"群力",
				"共乐",
				"建国公园",
				"田地街",
				"正阳河",
				"透笼街",
				"新阳路",
				"人才市场",
				"经纬",
				"商业大学"
			  ],
			  "南岗区": [
				"不限",
				"红旗",
				"嵩山路",
				"会展中心",
				"先锋",
				"哈西",
				"工电路",
				"黑龙江大学",
				"宣化街",
				"省政府",
				"汉水路",
				"新乐",
				"荣市",
				"新吉商城",
				"奋斗",
				"哈工大",
				"民益街",
				"新春",
				"大成",
				"长江路",
				"松花江",
				"鸿翔路",
				"东大直街",
				"医大二院",
				"七政",
				"赣水路",
				"泰山路",
				"和兴",
				"昆仑商城",
				"西大桥",
				"燎原",
				"南直路"
			  ],
			  "不限": "",
			  "平房区": [
				"不限",
				"友协"
			  ],
			  "香坊区": [
				"不限",
				"哈平路",
				"安乐",
				"和平路",
				"民生路",
				"公滨路",
				"六顺",
				"赣水路",
				"新成",
				"香顺街",
				"东北农业大学",
				"昆仑商城",
				"大庆路"
			  ],
			  "道外区": [
				"不限"
			  ],
			  "松北区": [
				"不限"
			  ]
			},
			"东莞": {
			  "不限": "",
			  "东莞市市辖区": [
				"不限"
			  ]
			},
			"新乡": {
			  "牧野区": [
				"不限"
			  ],
			  "辉县市": [
				"不限"
			  ],
			  "延津县": [
				"不限"
			  ],
			  "不限": "",
			  "红旗区": [
				"不限"
			  ],
			  "卫滨区": [
				"不限"
			  ],
			  "新乡县": [
				"不限"
			  ]
			},
			"邯郸": {
			  "邯郸县": [
				"不限"
			  ],
			  "复兴区": [
				"不限"
			  ],
			  "丛台区": [
				"不限"
			  ],
			  "邯山区": [
				"不限"
			  ],
			  "不限": "",
			  "永年县": [
				"不限"
			  ],
			  "武安市": [
				"不限"
			  ]
			},
			"葫芦岛": {
			  "绥中县": [
				"不限"
			  ],
			  "不限": ""
			},
			"西安": {
			  "西安国家民用航天产业基地": [
				"不限"
			  ],
			  "新城区": [
				"不限",
				"金花路",
				"康复路",
				"火车站",
				"解放路",
				"尚勤路",
				"北大街",
				"北关",
				"西京医院",
				"自强路",
				"长乐西路",
				"文昌门",
				"大差市",
				"东大街",
				"长乐中路"
			  ],
			  "浐灞生态区": [
				"不限"
			  ],
			  "莲湖区": [
				"不限",
				"劳动公园",
				"锦园小区",
				"玉祥门",
				"西稍门",
				"城西客运站",
				"汉城路沿线",
				"环城西路",
				"张家村",
				"土门",
				"北院门",
				"北大街",
				"枣园",
				"安定门",
				"西华门",
				"西关",
				"西大街",
				"莲湖公园",
				"桃园路",
				"红庙坡",
				"丰庆路",
				"丰禾路",
				"大观园"
			  ],
			  "灞桥区": [
				"不限",
				"纺织城",
				"十里铺"
			  ],
			  "高新技术产业开发区": [
				"不限",
				"唐延路",
				"科技二路",
				"高新路",
				"科技一路",
				"光华路",
				"玫瑰大楼",
				"沣惠南路",
				"旺座现代城",
				"科技路西口",
				"亚美大厦"
			  ],
			  "碑林区": [
				"不限",
				"小雁塔",
				"长安路",
				"和平门",
				"西安交大",
				"文昌门",
				"环城南路",
				"建国门",
				"太乙路",
				"朱雀大街",
				"西北大",
				"边家村",
				"文艺路",
				"何家村",
				"和平路",
				"东木头市",
				"东大街",
				"互助路立交",
				"南大街",
				"南院门",
				"东门外",
				"东关南街",
				"建设路",
				"张家村",
				"长乐坊"
			  ],
			  "雁塔区": [
				"不限",
				"科技二路",
				"南郊大学区",
				"高新路",
				"唐延路",
				"电子城",
				"科技一路",
				"旺座现代城",
				"沣惠南路",
				"科技路西口",
				"长延堡",
				"大雁塔",
				"太白小区",
				"电视塔",
				"光华路",
				"玫瑰大楼",
				"明德门",
				"永松路",
				"杨家村",
				"鱼化寨",
				"西影路",
				"北山门",
				"朱雀大街",
				"吉祥路",
				"等驾坡",
				"翠华路",
				"亚美大厦",
				"电子正街",
				"丁白路"
			  ],
			  "未央区": [
				"不限",
				"未央路沿线",
				"张家堡",
				"文景路",
				"经济技术开发区",
				"凤城一路",
				"雅荷花园",
				"凤城四路",
				"二府庄",
				"方新村",
				"龙首村",
				"太华路",
				"草滩",
				"三桥"
			  ],
			  "长安区": [
				"不限",
				"郭杜",
				"韦曲"
			  ],
			  "不限": "",
			  "国际港务区": [
				"不限"
			  ],
			  "曲江新区": [
				"不限"
			  ],
			  "经济技术开发区": [
				"不限"
			  ]
			},
			"云浮": {
			  "不限": "",
			  "云城区": [
				"不限"
			  ]
			},
			"西宁": {
			  "城西区": [
				"不限"
			  ],
			  "城中区": [
				"不限"
			  ],
			  "不限": ""
			},
			"大理": {
			  "不限": "",
			  "大理市": [
				"不限"
			  ]
			},
			"漯河": {
			  "不限": "",
			  "召陵区": [
				"不限"
			  ]
			},
			"重庆": {
			  "彭水苗族土家族自治县": [
				"不限"
			  ],
			  "南岸区": [
				"不限",
				"南坪",
				"海棠溪",
				"南滨路",
				"四公里",
				"花园路",
				"铜元局",
				"回龙湾",
				"玄坛庙",
				"涂山",
				"弹子石",
				"龙门浩"
			  ],
			  "梁平县": [
				"不限"
			  ],
			  "北碚区": [
				"不限",
				"天府",
				"朝阳",
				"蔡家岗",
				"龙凤桥",
				"北温泉"
			  ],
			  "沙坪坝区": [
				"不限",
				"小龙坎",
				"渝碚路",
				"覃家岗",
				"重庆大学",
				"西永",
				"天星桥",
				"汉渝路",
				"新桥",
				"土湾",
				"土主",
				"歌乐山"
			  ],
			  "渝中区": [
				"不限",
				"大坪",
				"朝天门",
				"解放碑",
				"两路口",
				"嘉滨路",
				"上清寺",
				"化龙桥",
				"较场口",
				"大溪沟",
				"鹅岭",
				"菜园坝",
				"七星岗",
				"王家坡"
			  ],
			  "永川区": [
				"不限"
			  ],
			  "巴南区": [
				"不限",
				"花溪"
			  ],
			  "江北区": [
				"不限",
				"观音桥",
				"洋河花园",
				"华新街",
				"五里店",
				"大石坝",
				"石马河",
				"寸滩",
				"铁山坪"
			  ],
			  "渝北区": [
				"不限",
				"龙溪",
				"冉家坝",
				"人和",
				"大竹林",
				"回兴",
				"鸳鸯",
				"两路",
				"双龙湖",
				"松树桥",
				"双凤桥"
			  ],
			  "云阳县": [
				"不限"
			  ],
			  "九龙坡区": [
				"不限",
				"高新区",
				"九龙",
				"石桥铺",
				"谢家湾",
				"渝州路",
				"杨家坪",
				"石坪桥",
				"石板",
				"白市驿"
			  ],
			  "不限": "",
			  "大渡口区": [
				"不限",
				"八桥",
				"九宫庙",
				"春晖路",
				"大渡口公园"
			  ],
			  "垫江县": [
				"不限"
			  ],
			  "璧山县": [
				"不限"
			  ],
			  "巫山县": [
				"不限"
			  ]
			},
			"黄冈": {
			  "不限": ""
			},
			"怀化": {
			  "不限": "",
			  "鹤城区": [
				"不限"
			  ]
			},
			"焦作": {
			  "解放区": [
				"不限"
			  ],
			  "不限": ""
			},
			"日照": {
			  "五莲县": [
				"不限"
			  ],
			  "不限": "",
			  "东港区": [
				"不限"
			  ]
			},
			"厦门": {
			  "湖里区": [
				"不限",
				"塘边",
				"禾山",
				"嘉园路",
				"湖里公园",
				"百乐园",
				"江头",
				"殿前",
				"金尚路",
				"大唐世家",
				"兴隆路",
				"东渡路",
				"金山小区",
				"穆厝",
				"湖里大道",
				"台湾街",
				"吕岭路",
				"嘉禾路",
				"康乐",
				"南山路"
			  ],
			  "翔安区": [
				"不限",
				"马巷"
			  ],
			  "集美区": [
				"不限",
				"后溪",
				"同集南路",
				"侨英",
				"杏林",
				"印斗路",
				"银江路",
				"集美学村"
			  ],
			  "同安区": [
				"不限"
			  ],
			  "思明区": [
				"不限",
				"软件园",
				"莲前",
				"前埔医院",
				"开元",
				"梧村",
				"厦禾路",
				"厦门大学",
				"湖滨北路",
				"国贸",
				"滨海",
				"中华",
				"鹭江",
				"莲花",
				"莲坂",
				"胡里山",
				"白鹭洲公园",
				"禾祥西路",
				"湖滨南路",
				"七星西路",
				"厦港",
				"仙岳路",
				"嘉莲",
				"鼓浪屿",
				"松柏",
				"南普陀",
				"前埔村"
			  ],
			  "不限": "",
			  "海沧区": [
				"不限",
				"石塘",
				"沧林路",
				"海富路",
				"新阳工业区"
			  ]
			},
			"北京": {
			  "东城区": [
				"不限",
				"东四",
				"东直门",
				"朝阳门",
				"雍和宫",
				"海运仓",
				"和平里",
				"北新桥",
				"安定门",
				"花市",
				"广渠门",
				"光明楼",
				"东单",
				"王府井",
				"北京站",
				"磁器口",
				"灯市口",
				"建国门",
				"交道口",
				"崇文门",
				"天安门",
				"天坛",
				"鼓楼",
				"体育馆路",
				"永定门",
				"龙潭湖",
				"法华寺",
				"景山",
				"前门",
				"沙滩"
			  ],
			  "密云区": [
				"不限"
			  ],
			  "房山区": [
				"不限",
				"良乡",
				"长阳",
				"阎村",
				"房山城关",
				"迎风",
				"窦店"
			  ],
			  "海淀区": [
				"不限",
				"中关村",
				"上地",
				"马连洼",
				"苏州街",
				"西二旗",
				"知春路",
				"五道口",
				"北京大学",
				"双榆树",
				"西北旺",
				"苏州桥",
				"学院路",
				"北航",
				"清河",
				"清华大学",
				"万泉河",
				"人民大学",
				"颐和园",
				"北太平庄",
				"小营",
				"西三旗",
				"四季青",
				"大钟寺",
				"魏公村",
				"白石桥",
				"双安",
				"蓟门桥",
				"牡丹园",
				"紫竹桥",
				"皂君庙",
				"世纪城",
				"马甸",
				"航天桥",
				"北下关",
				"远大路",
				"万寿寺",
				"花园桥",
				"健翔桥",
				"交通大学",
				"西直门",
				"万寿路",
				"公主坟",
				"万柳",
				"甘家口",
				"北洼路",
				"五棵松",
				"车道沟",
				"定慧寺",
				"永定路",
				"田村",
				"二里庄",
				"西苑",
				"青塔",
				"香山",
				"木樨地",
				"军博"
			  ],
			  "丰台区": [
				"不限",
				"看丹桥",
				"科技园区",
				"世界公园",
				"花乡",
				"马家堡",
				"北大地",
				"木樨园",
				"东铁匠营",
				"六里桥",
				"太平桥",
				"刘家窑",
				"角门",
				"草桥",
				"方庄",
				"嘉园",
				"洋桥",
				"西客站",
				"丽泽桥",
				"大红门",
				"岳各庄",
				"卢沟桥",
				"玉泉营",
				"宋家庄",
				"丰台体育馆",
				"成寿寺",
				"右安门",
				"青塔",
				"开阳里",
				"赵公口",
				"蒲黄榆",
				"新发地",
				"大观园",
				"菜户营",
				"西罗园",
				"南苑",
				"长辛店",
				"云岗",
				"马连道",
				"东高地"
			  ],
			  "朝阳区": [
				"不限",
				"望京",
				"大山子",
				"酒仙桥",
				"花家地",
				"来广营",
				"大望路",
				"朝外",
				"十里堡",
				"三元桥",
				"国贸",
				"北苑",
				"京广桥",
				"建外大街",
				"四惠",
				"百子湾",
				"华贸",
				"将台路",
				"亮马桥",
				"奥运村",
				"亚运村",
				"团结湖",
				"大屯",
				"三里屯",
				"立水桥",
				"东大桥",
				"工体",
				"红庙",
				"燕莎",
				"呼家楼",
				"姚家园",
				"高碑店",
				"左家庄",
				"南磨房",
				"双井",
				"国展",
				"八里庄",
				"管庄",
				"劲松",
				"甘露园",
				"太阳宫",
				"小关",
				"朝阳公园",
				"定福庄",
				"对外经贸",
				"小营",
				"西坝河",
				"建国门",
				"石佛营",
				"安贞",
				"安慧桥",
				"健翔桥",
				"双桥",
				"潘家园",
				"安华",
				"芍药居",
				"柳芳",
				"和平里",
				"十八里店",
				"广渠门",
				"北沙滩",
				"惠新里",
				"常营",
				"水碓子",
				"麦子店",
				"甜水园",
				"和平街",
				"安定门",
				"垡头",
				"小红门",
				"豆各庄",
				"方庄",
				"东坝",
				"世贸天阶"
			  ],
			  "门头沟区": [
				"不限",
				"永定",
				"龙泉",
				"大峪"
			  ],
			  "延庆区": [
				"不限"
			  ],
			  "怀柔区": [
				"不限",
				"怀柔城区",
				"泉河"
			  ],
			  "通州区": [
				"不限",
				"西门",
				"北苑",
				"永顺",
				"果园",
				"梨园",
				"九棵树",
				"新华大街",
				"中仓",
				"马驹桥",
				"八里桥",
				"新华联",
				"临河里",
				"玉桥",
				"土桥",
				"张家湾",
				"乔庄",
				"北关",
				"运河大街",
				"潞城",
				"武夷花园"
			  ],
			  "平谷区": [
				"不限",
				"峪口",
				"渔阳",
				"滨河"
			  ],
			  "不限": "",
			  "顺义区": [
				"不限",
				"后沙峪",
				"新国展",
				"天竺",
				"南彩",
				"仁和",
				"顺义城区",
				"马坡",
				"李桥",
				"胜利",
				"杨镇",
				"光明"
			  ],
			  "石景山区": [
				"不限",
				"杨庄",
				"鲁谷",
				"八宝山",
				"苹果园",
				"八角",
				"八大处",
				"古城",
				"永乐",
				"老山",
				"金顶街",
				"模式口",
				"衙门口",
				"广宁"
			  ],
			  "西城区": [
				"不限",
				"德胜门",
				"新街口",
				"西直门",
				"复兴门",
				"宣武门",
				"和平门",
				"小西天",
				"阜成门",
				"月坛",
				"官园",
				"金融街",
				"展览路",
				"长椿街",
				"南礼士路",
				"菜市口",
				"广安门",
				"西单",
				"广外大街",
				"天宁寺",
				"西便门",
				"广内大街",
				"牛街",
				"车公庄",
				"陶然亭",
				"百万庄",
				"白纸坊",
				"三里河",
				"虎坊桥",
				"西四",
				"什刹海",
				"天桥",
				"西客站",
				"前门",
				"木樨地",
				"右安门",
				"地安门",
				"牡丹园",
				"马连道",
				"积水潭",
				"珠市口",
				"六铺炕",
				"南菜园",
				"大栅栏",
				"后海",
				"红莲",
				"白广路",
				"太平桥"
			  ],
			  "大兴区": [
				"不限",
				"亦庄",
				"西红门",
				"清源",
				"兴丰大街",
				"滨河",
				"黄村",
				"旧宫",
				"同兴园",
				"清和园",
				"兴华大街",
				"兴业大街",
				"庞各庄"
			  ],
			  "昌平区": [
				"不限",
				"回龙观",
				"龙泽",
				"东小口",
				"天通苑",
				"立水桥",
				"清河",
				"霍营",
				"城南",
				"昌平县城",
				"城北",
				"北七家",
				"马池口",
				"百善",
				"南邵",
				"小汤山",
				"阳坊"
			  ]
			},
			"武汉": {
			  "江汉区": [
				"不限",
				"汉口火车站",
				"常青路",
				"汉兴",
				"西北湖",
				"北湖",
				"王家墩",
				"万松",
				"武广",
				"中山公园",
				"唐家墩",
				"前进",
				"水塔",
				"新华",
				"民意"
			  ],
			  "武汉吴家山经济技术开发区": [
				"不限"
			  ],
			  "武昌区": [
				"不限",
				"中南路",
				"武珞路",
				"东湖路",
				"中北路",
				"丁字桥",
				"水果湖",
				"徐东",
				"武昌火车站",
				"友谊大道",
				"徐家棚",
				"南湖",
				"积玉桥",
				"新河",
				"紫阳路",
				"小东门",
				"大东门",
				"武泰闸",
				"余家头",
				"珞珈山",
				"粮道街",
				"首义路",
				"杨园",
				"阅马场",
				"和平大道",
				"黄鹤楼",
				"司门口",
				"东亭",
				"紫阳",
				"白沙洲"
			  ],
			  "新洲区": [
				"不限"
			  ],
			  "武汉经济技术开发区": [
				"不限"
			  ],
			  "江岸区": [
				"不限",
				"车站",
				"劳动",
				"解放公园",
				"百步亭",
				"岱山",
				"丹水池",
				"建设大道",
				"永清",
				"竹叶山",
				"后湖",
				"二七",
				"新村",
				"江汉路",
				"客运港",
				"花桥"
			  ],
			  "江夏区": [
				"不限",
				"流芳"
			  ],
			  "硚口区": [
				"不限",
				"古田",
				"韩家墩",
				"宗关",
				"汉中",
				"硚口路",
				"宝丰",
				"易家墩",
				"汉水桥",
				"汉正街",
				"崇仁",
				"荣华"
			  ],
			  "不限": "",
			  "汉阳区": [
				"不限",
				"王家湾",
				"琴断口",
				"鹦鹉",
				"钟家村",
				"翠微",
				"建桥",
				"汉阳大道",
				"江汉二桥",
				"月湖",
				"晴川"
			  ],
			  "蔡甸区": [
				"不限",
				"沌口"
			  ],
			  "青山区": [
				"不限",
				"工人村",
				"南干渠",
				"冶金"
			  ],
			  "东西湖区": [
				"不限",
				"吴家山",
				"金银湖",
				"李家墩",
				"三店",
				"长青",
				"新沟",
				"常青花园"
			  ],
			  "洪山区": [
				"不限",
				"光谷",
				"鲁巷",
				"关山",
				"珞南",
				"街道口",
				"红旗",
				"广埠屯",
				"南湖",
				"珞狮南路",
				"卓刀泉",
				"陈家湾",
				"徐东",
				"白沙洲"
			  ],
			  "黄陂区": [
				"不限",
				"滠口"
			  ],
			  "东湖新技术开发区": [
				"不限"
			  ]
			},
			"宿州": {
			  "不限": "",
			  "埇桥区": [
				"不限"
			  ],
			  "萧县": [
				"不限"
			  ]
			},
			"上海": {
			  "松江区": [
				"不限",
				"九亭",
				"松江新城",
				"方松",
				"松江大学城",
				"中山",
				"新桥",
				"松江工业区",
				"泗泾",
				"永丰",
				"洞泾"
			  ],
			  "闸北区": [
				"不限",
				"汶水路",
				"大宁路",
				"共和新路",
				"闸北公园",
				"天目西路",
				"西藏北路",
				"彭浦新村",
				"北区汽车站",
				"柳营路",
				"和田",
				"场中路",
				"宝山路",
				"芷江西路",
				"老北站",
				"延长路",
				"七浦路"
			  ],
			  "黄浦区": [
				"不限",
				"人民广场",
				"打浦桥",
				"新天地",
				"外滩",
				"南京东路",
				"西藏南路",
				"金陵东路",
				"北京东路",
				"淮海路",
				"城隍庙",
				"五里桥",
				"瑞金宾馆区",
				"制造局路",
				"云南路",
				"瑞金医院",
				"老西门",
				"淮海公园",
				"董家渡",
				"复兴公园",
				"复兴中路",
				"南外滩",
				"鲁班路",
				"半淞园路",
				"南浦大桥",
				"豫园",
				"十六铺",
				"大兴街",
				"茂名南路",
				"九院",
				"陕西南路"
			  ],
			  "崇明县": [
				"不限",
				"城桥"
			  ],
			  "长宁区": [
				"不限",
				"北新泾",
				"中山公园",
				"虹桥",
				"上海影城",
				"新华路",
				"江苏路地铁",
				"镇宁路",
				"古北",
				"动物园",
				"仙霞新村",
				"娄山关路",
				"天山路",
				"遵义路",
				"虹桥机场",
				"淮海西路",
				"程家桥"
			  ],
			  "青浦区": [
				"不限",
				"徐泾",
				"赵巷",
				"重固",
				"白鹤",
				"朱家角"
			  ],
			  "闵行区": [
				"不限",
				"万源城",
				"漕宝路",
				"东兰路",
				"虹桥",
				"浦江",
				"莘庄",
				"七宝",
				"南方商城",
				"春申",
				"梅陇",
				"静安新城",
				"航华",
				"莘庄工业区",
				"老闵行",
				"颛桥",
				"龙柏",
				"古美",
				"锦江乐园",
				"华漕",
				"马桥",
				"江川路",
				"罗阳",
				"交通大学",
				"吴泾"
			  ],
			  "静安区": [
				"不限",
				"南京西路",
				"北京西路",
				"上海电视台",
				"静安寺",
				"江宁路",
				"同乐坊",
				"吴江路",
				"新闸路",
				"康定路",
				"西康路",
				"曹家渡",
				"镇宁路",
				"华山医院"
			  ],
			  "虹口区": [
				"不限",
				"江湾",
				"四川北路",
				"海宁路",
				"鲁迅公园",
				"虹口足球场",
				"四平路",
				"东宝兴路",
				"广中路",
				"大柏树",
				"和平公园",
				"凉城",
				"曲阳地区",
				"周家嘴路",
				"运光",
				"大连",
				"临平路"
			  ],
			  "不限": "",
			  "奉贤区": [
				"不限",
				"南桥",
				"金汇",
				"奉城"
			  ],
			  "宝山区": [
				"不限",
				"淞南",
				"庙行",
				"共富新村",
				"顾村",
				"吴淞",
				"大场",
				"杨行",
				"张庙",
				"通河新村",
				"锦秋花园",
				"高境",
				"北翼商业街",
				"大华",
				"共康",
				"月浦",
				"友谊路",
				"淞宝",
				"长江西路",
				"泗塘新村"
			  ],
			  "浦东新区": [
				"不限",
				"张江",
				"东方路",
				"东外滩",
				"世纪公园",
				"塘桥",
				"梅园",
				"潍坊",
				"八佰伴",
				"陆家嘴",
				"源深体育中心",
				"世博园区",
				"花木",
				"洋泾",
				"金桥",
				"碧云社区",
				"北蔡",
				"联洋",
				"六里",
				"龙阳路地铁",
				"上南地区",
				"金杨新村",
				"三林",
				"唐镇",
				"南码头",
				"东明路",
				"临沂路",
				"上钢新村",
				"外高桥",
				"杨浦大桥",
				"周浦",
				"杨东",
				"曹路",
				"川沙",
				"高行",
				"周家渡",
				"临港新城",
				"航头",
				"祝桥",
				"惠南",
				"新场",
				"正大广场"
			  ],
			  "徐汇区": [
				"不限",
				"漕宝路",
				"漕河泾",
				"田林",
				"徐家汇",
				"交通大学",
				"龙华",
				"万体馆",
				"肇嘉浜路",
				"上海南站",
				"斜土路",
				"上海体育场",
				"日晖",
				"植物园",
				"上海师大",
				"岳阳",
				"淮海西路",
				"音乐学院",
				"虹梅路",
				"襄阳公园",
				"衡山路",
				"丁香花园",
				"复兴西路",
				"长桥",
				"复兴中路",
				"枫林路",
				"湖南路",
				"华东理工",
				"华泾",
				"凌云路"
			  ],
			  "金山区": [
				"不限",
				"枫泾"
			  ],
			  "嘉定区": [
				"不限",
				"江桥",
				"嘉定城区",
				"南翔",
				"真新新村",
				"丰庄",
				"菊园新区",
				"马陆",
				"安亭"
			  ],
			  "杨浦区": [
				"不限",
				"五角场",
				"大学区",
				"长阳路",
				"周家嘴路",
				"长海医院",
				"复旦大学",
				"黄兴公园",
				"平凉路",
				"四平路",
				"延吉",
				"长白新村",
				"江浦路",
				"杨浦大桥",
				"控江路",
				"新江湾城",
				"新华医院",
				"鞍山",
				"东外滩",
				"中原",
				"杨浦公园"
			  ],
			  "普陀区": [
				"不限",
				"金沙江路",
				"长征",
				"长风公园",
				"华师大",
				"梅川路",
				"长寿路",
				"曹杨",
				"中山北路",
				"武宁路",
				"桃浦",
				"光新",
				"康建",
				"真如",
				"石泉路",
				"玉佛寺",
				"中远两湾城",
				"甘泉路",
				"宜川路",
				"万里城",
				"真光新村"
			  ]
			},
			"鞍山": {
			  "不限": "",
			  "千山区": [
				"不限"
			  ]
			},
			"湛江": {
			  "霞山区": [
				"不限"
			  ],
			  "坡头区": [
				"不限"
			  ],
			  "不限": "",
			  "赤坎区": [
				"不限"
			  ]
			},
			"牡丹江": {
			  "不限": "",
			  "西安区": [
				"不限"
			  ]
			},
			"永州": {
			  "冷水滩区": [
				"不限"
			  ],
			  "不限": ""
			},
			"宜昌": {
			  "西陵区": [
				"不限"
			  ],
			  "不限": ""
			},
			"雅安": {
			  "雨城区": [
				"不限"
			  ],
			  "不限": ""
			},
			"宁波": {
			  "海曙区": [
				"不限"
			  ],
			  "鄞州区": [
				"不限"
			  ],
			  "奉化市": [
				"不限"
			  ],
			  "北仑区": [
				"不限"
			  ],
			  "象山县": [
				"不限"
			  ],
			  "江北区": [
				"不限"
			  ],
			  "不限": "",
			  "镇海区": [
				"不限"
			  ],
			  "余姚市": [
				"不限"
			  ],
			  "江东区": [
				"不限"
			  ],
			  "宁海县": [
				"不限"
			  ],
			  "慈溪市": [
				"不限"
			  ]
			},
			"呼和浩特": {
			  "赛罕区": [
				"不限"
			  ],
			  "玉泉区": [
				"不限"
			  ],
			  "不限": "",
			  "新城区": [
				"不限"
			  ],
			  "托克托县": [
				"不限"
			  ]
			},
			"宜春": {
			  "高安市": [
				"不限"
			  ],
			  "不限": "",
			  "袁州区": [
				"不限"
			  ]
			},
			"绵阳": {
			  "涪城区": [
				"不限"
			  ],
			  "不限": "",
			  "安县": [
				"不限"
			  ],
			  "江油市": [
				"不限"
			  ]
			},
			"扬州": {
			  "不限": "",
			  "邗江区": [
				"不限"
			  ],
			  "广陵区": [
				"不限"
			  ]
			},
			"桂林": {
			  "象山区": [
				"不限"
			  ],
			  "不限": "",
			  "秀峰区": [
				"不限"
			  ],
			  "阳朔县": [
				"不限"
			  ],
			  "七星区": [
				"不限"
			  ]
			},
			"河池": {
			  "都安瑶族自治县": [
				"不限"
			  ],
			  "不限": "",
			  "金城江区": [
				"不限"
			  ]
			},
			"丽江": {
			  "不限": "",
			  "古城区": [
				"不限"
			  ]
			},
			"宝鸡": {
			  "不限": "",
			  "渭滨区": [
				"不限"
			  ],
			  "金台区": [
				"不限"
			  ]
			},
			"十堰": {
			  "不限": "",
			  "茅箭区": [
				"不限"
			  ],
			  "张湾区": [
				"不限"
			  ]
			},
			"广安": {
			  "广安区": [
				"不限"
			  ],
			  "不限": "",
			  "邻水县": [
				"不限"
			  ]
			},
			"玉溪": {
			  "不限": "",
			  "红塔区": [
				"不限"
			  ]
			},
			"舟山": {
			  "定海区": [
				"不限"
			  ],
			  "不限": ""
			},
			"沈阳": {
			  "铁西区": [
				"不限",
				"铁西广场",
				"卫工",
				"兴华",
				"重工",
				"云峰",
				"启工",
				"七路",
				"贵和",
				"笃工",
				"保工",
				"兴工",
				"滑翔小区",
				"霁虹"
			  ],
			  "新民市": [
				"不限"
			  ],
			  "不限": "",
			  "于洪区": [
				"不限",
				"陵西"
			  ],
			  "大东区": [
				"不限",
				"东站",
				"珠林",
				"小北",
				"东塔",
				"大东路",
				"大东广场",
				"大北",
				"小津桥",
				"小东",
				"二台子",
				"辽沈",
				"新东"
			  ],
			  "和平区": [
				"不限",
				"五里河",
				"南湖公园",
				"文体西路",
				"马路湾",
				"南市",
				"集贤",
				"新兴",
				"文化路",
				"和平广场",
				"太原街",
				"民主",
				"中华路",
				"长白",
				"八经",
				"胜利",
				"云集",
				"十四纬路",
				"新华",
				"西塔"
			  ],
			  "沈河区": [
				"不限",
				"市府",
				"北站",
				"惠工",
				"奉天街沿线",
				"滨河",
				"一经",
				"文艺路",
				"文化路",
				"大西街",
				"二经",
				"故宫",
				"朱剪炉",
				"中街"
			  ],
			  "浑南区": [
				"不限",
				"五三",
				"白塔",
				"天坛小区",
				"南塔"
			  ],
			  "皇姑区": [
				"不限",
				"北陵",
				"崇山",
				"辽河",
				"黑龙江",
				"塔湾",
				"北行",
				"辽大",
				"舍利塔",
				"长江",
				"昆山",
				"北塔",
				"陵西"
			  ],
			  "沈北新区": [
				"不限",
				"新城子"
			  ]
			},
			"齐齐哈尔": {
			  "建华区": [
				"不限"
			  ],
			  "甘南县": [
				"不限"
			  ],
			  "不限": ""
			},
			"铁岭": {
			  "银州区": [
				"不限"
			  ],
			  "不限": ""
			},
			"银川": {
			  "西夏区": [
				"不限"
			  ],
			  "不限": "",
			  "兴庆区": [
				"不限"
			  ],
			  "灵武市": [
				"不限"
			  ],
			  "金凤区": [
				"不限"
			  ]
			},
			"鄂尔多斯": {
			  "不限": "",
			  "东胜区": [
				"不限"
			  ]
			},
			"广州": {
			  "南沙区": [
				"不限",
				"黄阁",
				"万顷沙"
			  ],
			  "增城市": [
				"不限"
			  ],
			  "白云区": [
				"不限",
				"新市",
				"白云大道",
				"机场路",
				"黄石",
				"永平",
				"嘉禾",
				"三元里",
				"广园路",
				"棠景",
				"景泰",
				"龙归",
				"石井",
				"均禾",
				"同德",
				"同和",
				"人和",
				"太和",
				"京溪",
				"金沙",
				"罗冲围",
				"松洲",
				"南湖",
				"矿泉",
				"桂花岗",
				"江高",
				"钟落潭",
				"神山"
			  ],
			  "天河区": [
				"不限",
				"棠下",
				"天河公园",
				"跑马场",
				"珠江新城",
				"天园",
				"石牌",
				"沙河",
				"车陂",
				"五山",
				"龙口",
				"体育中心",
				"东圃",
				"天河城",
				"燕岭",
				"员村",
				"广州东站",
				"岗顶",
				"冼村",
				"天河北",
				"元岗",
				"黄村",
				"猎德",
				"林和",
				"长兴",
				"兴华",
				"前进",
				"岑村",
				"沙东",
				"龙洞",
				"粤垦"
			  ],
			  "从化市": [
				"不限"
			  ],
			  "花都区": [
				"不限",
				"新华",
				"雅瑶",
				"花东"
			  ],
			  "从化区": [
				"不限"
			  ],
			  "黄埔区": [
				"不限",
				"南岗",
				"荔联",
				"大沙",
				"鱼珠",
				"红山",
				"丰乐北路",
				"文冲",
				"穗东",
				"长洲"
			  ],
			  "不限": "",
			  "荔湾区": [
				"不限",
				"芳村",
				"白鹅潭",
				"黄沙",
				"西关",
				"沙面",
				"白鹤洞",
				"坑口",
				"彩虹",
				"陈家祠",
				"周门",
				"龙津",
				"南岸",
				"西村",
				"南源",
				"桥中",
				"环市西",
				"中山七八路",
				"东风西",
				"荔湾路",
				"上下九",
				"岭南",
				"昌华",
				"金花",
				"荔湾湖公园",
				"站前"
			  ],
			  "海珠区": [
				"不限",
				"客村",
				"赤岗",
				"琶洲",
				"新港",
				"官洲",
				"东晓",
				"中大",
				"江海",
				"滨江",
				"瑞宝",
				"江南大道",
				"广州大道南",
				"昌岗",
				"凤阳",
				"工业大道",
				"晓港",
				"龙凤",
				"南洲",
				"沙园",
				"海幢",
				"宝岗",
				"江燕路",
				"南华西",
				"素社",
				"南石头",
				"华洲"
			  ],
			  "增城": [
				"不限",
				"新塘",
				"朱村"
			  ],
			  "越秀区": [
				"不限",
				"岭南",
				"大新",
				"大东",
				"建设",
				"五羊新城",
				"水荫",
				"麓湖公园",
				"环市东",
				"登峰",
				"梅花村",
				"东风东",
				"黄花岗",
				"北京路",
				"二沙岛",
				"解放南",
				"东山口",
				"中山六路",
				"广卫",
				"海珠广场",
				"华乐",
				"东湖",
				"越秀公园",
				"锦城花园",
				"解放北",
				"人民北路",
				"流花",
				"洪桥",
				"六榕",
				"惠福东路",
				"东风西",
				"光塔",
				"小北",
				"矿泉",
				"淘金",
				"东川",
				"东都大世界"
			  ],
			  "增城区": [
				"不限"
			  ],
			  "萝岗区": [
				"不限"
			  ],
			  "番禺区": [
				"不限",
				"大学城",
				"大石",
				"沙头",
				"东环",
				"市桥",
				"洛溪",
				"清河东路",
				"南浦",
				"桥南",
				"祈福",
				"钟村",
				"沙湾",
				"石楼",
				"东涌",
				"灵山",
				"鱼窝头",
				"大岗"
			  ]
			},
			"临沂": {
			  "河东区": [
				"不限"
			  ],
			  "不限": "",
			  "兰山区": [
				"不限"
			  ],
			  "临沭县": [
				"不限"
			  ]
			},
			"苏州": {
			  "姑苏区": [
				"不限",
				"三香路",
				"火车站",
				"彩香",
				"拙政园",
				"石路",
				"苏锦",
				"南浩街",
				"景德路沿线",
				"南门",
				"胥江",
				"虎丘",
				"十全街",
				"留园",
				"凤凰街",
				"桃花坞",
				"盘门",
				"西园",
				"吴门桥",
				"山塘街",
				"娄门",
				"观前街"
			  ],
			  "张家港市": [
				"不限"
			  ],
			  "高新区": [
				"不限",
				"枫桥",
				"狮山",
				"东渚",
				"阳山",
				"浒墅关"
			  ],
			  "常熟市": [
				"不限"
			  ],
			  "太仓市": [
				"不限"
			  ],
			  "吴江区": [
				"不限",
				"汾湖",
				"松陵",
				"平望",
				"盛泽"
			  ],
			  "相城区": [
				"不限",
				"太平",
				"元和",
				"开发区",
				"陆慕",
				"黄埭",
				"阳澄湖",
				"渭塘"
			  ],
			  "昆山市": [
				"不限"
			  ],
			  "虎丘区": [
				"不限"
			  ],
			  "不限": "",
			  "工业园区": [
				"不限",
				"独墅湖",
				"娄葑",
				"东环路",
				"胜浦",
				"湖东",
				"青剑湖",
				"唯亭"
			  ],
			  "吴中区": [
				"不限",
				"城南",
				"长桥",
				"独墅湖",
				"湖西",
				"木渎",
				"娄葑",
				"开发区",
				"越溪",
				"苏苑",
				"葑门",
				"左岸商业街",
				"邻里中心",
				"龙西",
				"李公堤",
				"香山",
				"唯亭"
			  ]
			},
			"衢州": {
			  "柯城区": [
				"不限"
			  ],
			  "不限": "",
			  "衢江区": [
				"不限"
			  ]
			},
			"海东": {
			  "民和回族土族自治县": [
				"不限"
			  ],
			  "不限": ""
			},
			"六安": {
			  "金寨县": [
				"不限"
			  ],
			  "金安区": [
				"不限"
			  ],
			  "不限": ""
			},
			"济南": {
			  "高新区": [
				"不限",
				"齐鲁软件园"
			  ],
			  "天桥区": [
				"不限",
				"北园大街",
				"历山北路",
				"联四路",
				"凤凰山路",
				"凤凰山南路",
				"标山南路",
				"泺口",
				"水屯北路",
				"生产路",
				"三孔桥",
				"长途汽车站",
				"无影山北路",
				"堤口路",
				"北坦大街",
				"药山",
				"宝华街",
				"无影山"
			  ],
			  "济阳县": [
				"不限"
			  ],
			  "历城区": [
				"不限",
				"百花公园",
				"洪家楼",
				"华龙路",
				"全福",
				"南全福小区",
				"花园路",
				"将军路",
				"盖家沟",
				"花园小区",
				"山大路",
				"东风",
				"洪楼南路",
				"洪楼西路",
				"山大北路",
				"华信路",
				"工业北路",
				"七里河",
				"闵子骞路",
				"化纤厂路"
			  ],
			  "长清区": [
				"不限",
				"崮云湖"
			  ],
			  "槐荫区": [
				"不限",
				"经七纬十二",
				"西市场",
				"五里牌坊",
				"经十西路",
				"大金庄",
				"振兴街",
				"道德街",
				"二环西路",
				"段店北路",
				"经一路",
				"纬六路",
				"张庄路",
				"南辛庄",
				"刘长山路",
				"机床二厂路"
			  ],
			  "章丘市": [
				"不限"
			  ],
			  "不限": "",
			  "历下区": [
				"不限",
				"东门",
				"山大路",
				"山师东路",
				"大明湖",
				"黑虎泉",
				"司里街",
				"文化东路",
				"解放路",
				"省中医",
				"千佛山公园",
				"经十路",
				"银座商城",
				"趵突泉",
				"和平路",
				"大学科技园",
				"燕子山西路",
				"齐鲁软件园",
				"文化西路",
				"甸柳庄",
				"燕山立交桥",
				"二环东路",
				"中心医院",
				"泉城广场",
				"窑头路",
				"华阳路",
				"花园庄",
				"浆水泉",
				"解放东路",
				"省博物馆",
				"环山路",
				"公交总公司",
				"燕子山路",
				"山大南路",
				"甸柳新村",
				"山东经济学院",
				"燕山小区",
				"化纤厂路",
				"华能路"
			  ],
			  "市中区": [
				"不限",
				"大观园",
				"杆石桥",
				"人民商场",
				"经四路",
				"二环南路",
				"英雄山",
				"七里山",
				"经一路",
				"经二路",
				"山西路",
				"马鞍山",
				"馆驿街",
				"经八路",
				"省体育中心",
				"玉函路"
			  ]
			},
			"钦州": {
			  "钦北区": [
				"不限"
			  ],
			  "不限": ""
			},
			"伊犁": {
			  "不限": "",
			  "霍尔果斯市": [
				"不限"
			  ]
			},
			"湘潭": {
			  "岳塘区": [
				"不限"
			  ],
			  "湘潭县": [
				"不限"
			  ],
			  "不限": "",
			  "雨湖区": [
				"不限"
			  ]
			},
			"晋中": {
			  "不限": "",
			  "榆次区": [
				"不限"
			  ]
			},
			"江门": {
			  "新会区": [
				"不限"
			  ],
			  "台山市": [
				"不限"
			  ],
			  "江海区": [
				"不限"
			  ],
			  "蓬江区": [
				"不限"
			  ],
			  "不限": "",
			  "鹤山市": [
				"不限"
			  ]
			},
			"连云港": {
			  "不限": "",
			  "海州区": [
				"不限"
			  ],
			  "新浦区": [
				"不限"
			  ]
			},
			"郴州": {
			  "北湖区": [
				"不限"
			  ],
			  "不限": ""
			},
			"内江": {
			  "不限": "",
			  "市中区": [
				"不限"
			  ]
			},
			"南京": {
			  "雨花台区": [
				"不限",
				"宁南",
				"铁心桥",
				"安德门",
				"小行",
				"赛虹桥",
				"梅山",
				"西善桥",
				"雨花新村",
				"板桥",
				"能仁里"
			  ],
			  "栖霞区": [
				"不限",
				"仙林",
				"亚东",
				"尧化",
				"马群",
				"迈皋桥",
				"和燕路",
				"幕府山"
			  ],
			  "玄武区": [
				"不限",
				"珠江路",
				"梅园",
				"兰园",
				"后宰门",
				"紫金山",
				"新街口",
				"丹凤街",
				"玄武湖",
				"中山陵",
				"碑亭巷",
				"中央门",
				"玄武门",
				"樱驼花园",
				"卫岗",
				"孝陵卫",
				"太平门",
				"锁金村",
				"红山",
				"苜蓿园",
				"月苑"
			  ],
			  "江宁区": [
				"不限",
				"百家湖",
				"开发区",
				"东山",
				"大学城",
				"科学园",
				"岔路口",
				"方山",
				"秣陵",
				"上坊",
				"东善桥"
			  ],
			  "建邺区": [
				"不限",
				"沙洲",
				"兴隆",
				"建邺万达",
				"莫愁湖公园",
				"茶南",
				"双闸",
				"江心洲",
				"南苑",
				"湖西街",
				"长虹路",
				"水西门",
				"南湖",
				"白鹭花园"
			  ],
			  "浦口区": [
				"不限",
				"泰山",
				"沿江",
				"江浦"
			  ],
			  "溧水区": [
				"不限"
			  ],
			  "不限": "",
			  "六合区": [
				"不限",
				"龙池",
				"山潘",
				"葛塘"
			  ],
			  "鼓楼区": [
				"不限",
				"龙江",
				"南大",
				"西桥",
				"三牌楼",
				"江东",
				"草场门",
				"湖南路",
				"山西路",
				"南师大",
				"虎踞路",
				"玄武门",
				"中央路",
				"西站",
				"中山码头",
				"热河南路",
				"华侨路",
				"中央门",
				"建宁路",
				"丁家桥",
				"上海路",
				"将军庙",
				"福建路",
				"幕府山",
				"湖北路",
				"汉中门大街",
				"金陵小区",
				"宁海路"
			  ],
			  "高淳区": [
				"不限"
			  ],
			  "秦淮区": [
				"不限",
				"红花",
				"新街口",
				"中华门",
				"长白街",
				"常府街",
				"秦虹",
				"光华路",
				"夫子庙",
				"升州路",
				"集庆路",
				"苜蓿园",
				"海福巷",
				"汉中路",
				"石鼓路",
				"洪武路",
				"淮海路",
				"瑞金路",
				"大光路",
				"洪家园",
				"光华门",
				"朝天宫",
				"五老村",
				"双塘",
				"白衣庵",
				"长乐路"
			  ]
			},
			"长春": {
			  "宽城区": [
				"不限"
			  ],
			  "朝阳区": [
				"不限",
				"西安大路",
				"人民广场",
				"康平街",
				"文化广场",
				"中医学院",
				"工农大路",
				"红旗街",
				"南湖公园",
				"延安大路"
			  ],
			  "南关区": [
				"不限",
				"曙光",
				"解放大路",
				"平阳街",
				"世界雕塑公园",
				"卫星路",
				"人民大街",
				"鸿城",
				"亚泰大街",
				"幸福街",
				"卫星广场",
				"新立城",
				"树勋街",
				"明珠",
				"南关客运站"
			  ],
			  "经济开发区": [
				"不限"
			  ],
			  "绿园区": [
				"不限",
				"和平大街",
				"208医院"
			  ],
			  "不限": "",
			  "二道区": [
				"不限",
				"东南湖大路",
				"东环城路",
				"中东大市场",
				"公平路",
				"自由大路"
			  ],
			  "九台市": [
				"不限"
			  ],
			  "高新开发区": [
				"不限"
			  ],
			  "榆树市": [
				"不限"
			  ]
			},
			"德州": {
			  "乐陵市": [
				"不限"
			  ],
			  "不限": "",
			  "德城区": [
				"不限"
			  ],
			  "齐河县": [
				"不限"
			  ]
			},
			"温州": {
			  "瓯海区": [
				"不限"
			  ],
			  "龙湾区": [
				"不限"
			  ],
			  "不限": "",
			  "乐清市": [
				"不限"
			  ],
			  "永嘉县": [
				"不限"
			  ],
			  "鹿城区": [
				"不限"
			  ],
			  "瑞安市": [
				"不限"
			  ]
			},
			"平顶山": {
			  "不限": "",
			  "舞钢市": [
				"不限"
			  ]
			},
			"嘉兴": {
			  "嘉善县": [
				"不限"
			  ],
			  "平湖市": [
				"不限"
			  ],
			  "海盐县": [
				"不限"
			  ],
			  "桐乡市": [
				"不限"
			  ],
			  "海宁市": [
				"不限"
			  ],
			  "不限": "",
			  "秀洲区": [
				"不限"
			  ],
			  "南湖区": [
				"不限"
			  ]
			},
			"佛山": {
			  "南海区": [
				"不限",
				"桂城",
				"大沥",
				"狮山",
				"西樵",
				"丹灶"
			  ],
			  "顺德区": [
				"不限",
				"北滘",
				"陈村",
				"容桂",
				"乐从",
				"勒流",
				"大良",
				"龙江",
				"杏坛",
				"伦教"
			  ],
			  "不限": "",
			  "禅城区": [
				"不限",
				"汾江南路",
				"季华园",
				"石湾",
				"祖庙",
				"季华五路"
			  ],
			  "三水区": [
				"不限"
			  ]
			},
			"承德": {
			  "双滦区": [
				"不限"
			  ],
			  "不限": ""
			},
			"咸阳": {
			  "不限": "",
			  "泾阳县": [
				"不限"
			  ],
			  "秦都区": [
				"不限"
			  ],
			  "武功县": [
				"不限"
			  ],
			  "渭城区": [
				"不限"
			  ]
			},
			"柳州": {
			  "鱼峰区": [
				"不限"
			  ],
			  "城中区": [
				"不限"
			  ],
			  "不限": ""
			},
			"凉山彝族自治州": {
			  "西昌市": [
				"不限"
			  ],
			  "不限": ""
			},
			"白银": {
			  "不限": "",
			  "景泰县": [
				"不限"
			  ]
			},
			"惠州": {
			  "博罗县": [
				"不限"
			  ],
			  "惠阳区": [
				"不限"
			  ],
			  "不限": "",
			  "惠城区": [
				"不限"
			  ]
			},
			"榆林": {
			  "不限": "",
			  "神木县": [
				"不限"
			  ],
			  "榆阳区": [
				"不限"
			  ]
			},
			"长沙": {
			  "望城区": [
				"不限"
			  ],
			  "天心区": [
				"不限",
				"省政府",
				"黄土岭",
				"劳动西路",
				"涂家冲",
				"雅礼中学",
				"友谊路",
				"劳动广场",
				"侯家塘",
				"青园",
				"五凌电力",
				"铁道学院",
				"浦沅",
				"桂花坪",
				"仰天湖",
				"金盆岭",
				"南湖路",
				"第一师范",
				"裕南街",
				"长沙理工大学",
				"新开铺",
				"城南路",
				"窑岭",
				"书院南路",
				"碧湘街",
				"书院路",
				"东瓜山",
				"赤岭路"
			  ],
			  "宁乡县": [
				"不限"
			  ],
			  "开福区": [
				"不限",
				"湘江中路",
				"松桂园",
				"广电中心",
				"西长街",
				"洪山桥",
				"中山亭",
				"德雅村",
				"四方坪",
				"三一大道",
				"伍家岭",
				"潘家坪",
				"陈家湖",
				"烈士公园",
				"德雅路",
				"丽臣路",
				"科大佳园",
				"营盘路",
				"通泰街",
				"蒋家垅",
				"兴汉门",
				"二马路",
				"新河",
				"开福寺",
				"华夏路",
				"望麓园",
				"湘雅医院",
				"湘雅路"
			  ],
			  "浏阳市": [
				"不限"
			  ],
			  "不限": "",
			  "长沙县": [
				"不限"
			  ],
			  "芙蓉区": [
				"不限",
				"五一大道",
				"芙蓉广场",
				"黄兴路",
				"司门口",
				"远大路",
				"五里牌",
				"袁家岭",
				"杨家山",
				"马王堆",
				"芙蓉中路",
				"定王台",
				"五一广场",
				"府后街",
				"曙光路",
				"荷花园",
				"火星",
				"车站北路",
				"朝阳路",
				"万家丽",
				"朝阳街",
				"张公岭",
				"八一路",
				"东屯渡",
				"汽车东站",
				"湘湖",
				"识字岭",
				"浏城桥",
				"中山路",
				"车站中路",
				"松桂园",
				"锦泰广场",
				"芙蓉区政府",
				"农科院",
				"人民路立交桥",
				"湘雅二医院",
				"韭菜园",
				"德政园",
				"芙蓉苑",
				"人民中路",
				"三湘大市场"
			  ],
			  "岳麓区": [
				"不限",
				"麓谷",
				"麓谷锦园",
				"汽车西站",
				"桐梓坡",
				"银盆岭",
				"市政府",
				"望城坡",
				"观沙岭",
				"桐梓坡路",
				"玉兰路",
				"溁湾镇",
				"大学城",
				"麓山名园",
				"雷锋大道",
				"湖南商学院",
				"桔子洲",
				"天马山",
				"望岳",
				"王陵公园",
				"左家垅",
				"石岭塘",
				"中南大学",
				"西湖",
				"科教新村",
				"咸嘉湖",
				"英才园",
				"杜家塘",
				"枫林一路"
			  ],
			  "雨花区": [
				"不限",
				"高桥",
				"洞井铺",
				"芙蓉区政府",
				"汽车南站",
				"圭塘",
				"树木岭",
				"东塘",
				"狮子山",
				"雨花区政府",
				"航空路",
				"雨花亭",
				"砂子塘",
				"韶山中路",
				"香樟路",
				"桂花公园",
				"韶山南路",
				"井湾子",
				"涂家冲",
				"雅礼中学",
				"侯家塘",
				"窑岭",
				"长岭",
				"劳动西路",
				"茶园坡",
				"七里庙",
				"长沙卷烟厂",
				"劳动中路",
				"赤岗冲",
				"小林子冲",
				"桂花村",
				"铁道学院",
				"雅塘村"
			  ]
			},
			"中山": {
			  "不限": "",
			  "中山市市辖区": [
				"不限"
			  ]
			},
			"许昌": {
			  "许昌县": [
				"不限"
			  ],
			  "不限": ""
			},
			"大庆": {
			  "萨尔图区": [
				"不限"
			  ],
			  "不限": "",
			  "龙凤区": [
				"不限"
			  ]
			},
			"昆明": {
			  "呈贡区": [
				"不限"
			  ],
			  "五华区": [
				"不限"
			  ],
			  "盘龙区": [
				"不限"
			  ],
			  "西山区": [
				"不限"
			  ],
			  "不限": "",
			  "官渡区": [
				"不限"
			  ],
			  "安宁市": [
				"不限"
			  ]
			},
			"洛阳": {
			  "洛龙区": [
				"不限"
			  ],
			  "不限": "",
			  "涧西区": [
				"不限"
			  ],
			  "西工区": [
				"不限"
			  ]
			},
			"通辽": {
			  "科尔沁区": [
				"不限"
			  ],
			  "不限": ""
			},
			"衡阳": {
			  "石鼓区": [
				"不限"
			  ],
			  "不限": "",
			  "蒸湘区": [
				"不限"
			  ]
			},
			"佳木斯": {
			  "不限": "",
			  "郊区": [
				"不限"
			  ]
			},
			"阿克苏": {
			  "不限": "",
			  "阿克苏市": [
				"不限"
			  ]
			},
			"周口": {
			  "不限": "",
			  "西华县": [
				"不限"
			  ],
			  "扶沟县": [
				"不限"
			  ]
			},
			"铜仁": {
			  "不限": "",
			  "碧江区": [
				"不限"
			  ]
			},
			"岳阳": {
			  "岳阳楼区": [
				"不限"
			  ],
			  "不限": ""
			},
			"揭阳": {
			  "揭东区": [
				"不限"
			  ],
			  "榕城区": [
				"不限"
			  ],
			  "不限": "",
			  "普宁市": [
				"不限"
			  ]
			},
			"南充": {
			  "不限": "",
			  "顺庆区": [
				"不限"
			  ],
			  "嘉陵区": [
				"不限"
			  ]
			},
			"海口": {
			  "龙华区": [
				"不限"
			  ],
			  "琼山区": [
				"不限"
			  ],
			  "秀英区": [
				"不限"
			  ],
			  "不限": "",
			  "美兰区": [
				"不限"
			  ]
			},
			"南昌": {
			  "新建县": [
				"不限"
			  ],
			  "青山湖区": [
				"不限",
				"京东",
				"高新开发区",
				"南京东路",
				"上海路",
				"火炬广场",
				"解放东路",
				"江大南路",
				"上海北路",
				"罗家",
				"学院路",
				"顺外路",
				"湖坊",
				"发展路"
			  ],
			  "青云谱区": [
				"不限",
				"井冈山",
				"洪都",
				"三家店",
				"熊坊",
				"京山",
				"迎宾北大道",
				"解放西路",
				"徐家坊"
			  ],
			  "不限": "",
			  "东湖区": [
				"不限",
				"贤士花园",
				"南京西路",
				"八一大道",
				"大院",
				"滕王阁",
				"工人文化宫",
				"五纬路",
				"文教路",
				"二七北路",
				"江西师大"
			  ],
			  "南昌县": [
				"不限",
				"昌东"
			  ],
			  "新建区": [
				"不限"
			  ],
			  "湾里区": [
				"不限"
			  ],
			  "西湖区": [
				"不限",
				"绳金塔",
				"坛子口",
				"海关",
				"广场南路",
				"老福山",
				"系马桩",
				"朝阳洲",
				"洪城路",
				"十字街",
				"抚生路",
				"站前西路"
			  ]
			},
			"上饶": {
			  "信州区": [
				"不限"
			  ],
			  "不限": "",
			  "上饶县": [
				"不限"
			  ]
			},
			"遵义": {
			  "遵义县": [
				"不限"
			  ],
			  "汇川区": [
				"不限"
			  ],
			  "不限": "",
			  "红花岗区": [
				"不限"
			  ]
			},
			"萍乡": {
			  "安源区": [
				"不限"
			  ],
			  "湘东区": [
				"不限"
			  ],
			  "不限": ""
			},
			"威海": {
			  "乳山市": [
				"不限"
			  ],
			  "环翠区": [
				"不限"
			  ],
			  "不限": ""
			},
			"安阳": {
			  "不限": ""
			},
			"台北": {
			  "不限": ""
			},
			"开封": {
			  "开封市市辖区": [
				"不限"
			  ],
			  "不限": ""
			},
			"泉州": {
			  "不限": "",
			  "石狮市": [
				"不限"
			  ],
			  "惠安县": [
				"不限"
			  ],
			  "洛江区": [
				"不限"
			  ],
			  "南安市": [
				"不限"
			  ],
			  "晋江市": [
				"不限"
			  ],
			  "鲤城区": [
				"不限"
			  ],
			  "丰泽区": [
				"不限"
			  ]
			},
			"玉林": {
			  "不限": "",
			  "容县": [
				"不限"
			  ]
			},
			"北海": {
			  "不限": "",
			  "海城区": [
				"不限"
			  ]
			},
			"芜湖": {
			  "镜湖区": [
				"不限"
			  ],
			  "不限": "",
			  "芜湖县": [
				"不限"
			  ],
			  "鸠江区": [
				"不限"
			  ],
			  "弋江区": [
				"不限"
			  ]
			},
			"廊坊": {
			  "安次区": [
				"不限"
			  ],
			  "香河县": [
				"不限"
			  ],
			  "不限": "",
			  "广阳区": [
				"不限"
			  ],
			  "三河市": [
				"不限"
			  ],
			  "固安县": [
				"不限"
			  ]
			},
			"孝感": {
			  "不限": "",
			  "孝南区": [
				"不限"
			  ]
			},
			"兰州": {
			  "西固区": [
				"不限"
			  ],
			  "不限": "",
			  "安宁区": [
				"不限"
			  ],
			  "城关区": [
				"不限"
			  ],
			  "七里河区": [
				"不限"
			  ]
			},
			"汕头": {
			  "金平区": [
				"不限"
			  ],
			  "龙湖区": [
				"不限"
			  ],
			  "不限": "",
			  "澄海区": [
				"不限"
			  ],
			  "潮南区": [
				"不限"
			  ]
			},
			"唐山": {
			  "路南区": [
				"不限"
			  ],
			  "遵化市": [
				"不限"
			  ],
			  "路北区": [
				"不限"
			  ],
			  "不限": "",
			  "迁西县": [
				"不限"
			  ],
			  "迁安市": [
				"不限"
			  ]
			},
			"遂宁": {
			  "船山区": [
				"不限"
			  ],
			  "不限": ""
			},
			"安庆": {
			  "大观区": [
				"不限"
			  ],
			  "宜秀区": [
				"不限"
			  ],
			  "不限": "",
			  "桐城市": [
				"不限"
			  ]
			},
			"娄底": {
			  "不限": "",
			  "娄星区": [
				"不限"
			  ]
			},
			"清远": {
			  "清新区": [
				"不限"
			  ],
			  "不限": "",
			  "清城区": [
				"不限"
			  ]
			},
			"台中": {
			  "不限": ""
			},
			"辽阳": {
			  "不限": "",
			  "白塔区": [
				"不限"
			  ],
			  "宏伟区": [
				"不限"
			  ]
			},
			"宜宾": {
			  "翠屏区": [
				"不限"
			  ],
			  "不限": "",
			  "南溪区": [
				"不限"
			  ]
			},
			"绥化": {
			  "北林区": [
				"不限"
			  ],
			  "不限": ""
			},
			"无锡": {
			  "惠山区": [
				"不限"
			  ],
			  "梁溪区": [
				"不限"
			  ],
			  "锡山区": [
				"不限",
				"东亭",
				"东北塘",
				"安镇"
			  ],
			  "宜兴市": [
				"不限"
			  ],
			  "南长区": [
				"不限",
				"金匮",
				"清扬路",
				"扬名",
				"清名桥",
				"金城桥",
				"五爱路"
			  ],
			  "崇安区": [
				"不限",
				"新华书店",
				"上马墩",
				"江海",
				"广益",
				"广瑞路"
			  ],
			  "不限": "",
			  "滨湖区": [
				"不限",
				"雪浪",
				"蠡园",
				"蠡湖",
				"荣巷",
				"旺庄",
				"河埒"
			  ],
			  "北塘区": [
				"不限",
				"黄巷",
				"青石路",
				"北大街",
				"锡惠路",
				"霞美路"
			  ],
			  "江阴市": [
				"不限"
			  ],
			  "新吴区": [
				"不限"
			  ],
			  "无锡新区": [
				"不限"
			  ]
			},
			"金华": {
			  "婺城区": [
				"不限"
			  ],
			  "义乌市": [
				"不限"
			  ],
			  "不限": "",
			  "永康市": [
				"不限"
			  ],
			  "金东区": [
				"不限"
			  ]
			},
			"渭南": {
			  "华阴市": [
				"不限"
			  ],
			  "临渭区": [
				"不限"
			  ],
			  "不限": "",
			  "蒲城县": [
				"不限"
			  ]
			},
			"韶关": {
			  "不限": "",
			  "新丰县": [
				"不限"
			  ]
			},
			"龙岩": {
			  "不限": "",
			  "上杭县": [
				"不限"
			  ],
			  "新罗区": [
				"不限"
			  ]
			},
			"聊城": {
			  "东昌府区": [
				"不限"
			  ],
			  "阳谷县": [
				"不限"
			  ],
			  "不限": "",
			  "临清市": [
				"不限"
			  ]
			},
			"福州": {
			  "平潭县": [
				"不限"
			  ],
			  "晋安区": [
				"不限",
				"紫阳",
				"福新东路",
				"西园",
				"前横路",
				"秀山",
				"三八路",
				"长乐路",
				"二化",
				"东站",
				"茶园",
				"六一北路",
				"化工路",
				"王庄",
				"火车站",
				"金鸡山路",
				"洋下",
				"桂香"
			  ],
			  "闽侯县": [
				"不限"
			  ],
			  "台江区": [
				"不限",
				"茶亭",
				"鳌峰",
				"工业路",
				"三桥",
				"上海",
				"台江广场",
				"亚峰",
				"达道",
				"宝龙",
				"中亭街",
				"交通路",
				"荷泽",
				"八一七中路",
				"排尾",
				"台江步行街",
				"新港"
			  ],
			  "马尾区": [
				"不限",
				"马尾",
				"罗星"
			  ],
			  "长乐": [
				"不限"
			  ],
			  "闽清县": [
				"不限"
			  ],
			  "福清市": [
				"不限"
			  ],
			  "不限": "",
			  "鼓楼区": [
				"不限",
				"福州广场",
				"西禅寺",
				"温泉",
				"梅峰",
				"华大",
				"铜盘",
				"五凤",
				"东街口",
				"西湖公园",
				"左海",
				"湖头街",
				"杨桥中路",
				"西洪路",
				"侨雄",
				"五一广场",
				"湖东路",
				"五一路",
				"省立医院",
				"省体育中心",
				"乌山",
				"福新路",
				"双子星大厦",
				"琴亭",
				"湖前",
				"洪山桥",
				"屏山",
				"安泰",
				"古田路",
				"道山路",
				"东大路",
				"华林路",
				"五四路"
			  ],
			  "仓山区": [
				"不限",
				"建新",
				"金山",
				"橘园洲",
				"浦上",
				"马榕",
				"金山工业",
				"榕城广场",
				"洪塘",
				"白湖亭",
				"仓山科技园",
				"则徐大道",
				"淮安",
				"福州展览城",
				"仓前",
				"对湖",
				"下渡",
				"福建农林大学",
				"六一南路",
				"上三路"
			  ]
			}
		  }
		}
	
	job_data = {
		  "产品": {
			"产品设计师": [
			  "网页产品设计师",
			  "无线产品设计师"
			],
			"高端职位": [
			  "产品部经理",
			  "产品总监",
			  "游戏制作人"
			],
			"产品经理": [
			  "产品经理",
			  "网页产品经理",
			  "移动产品经理",
			  "产品助理",
			  "数据产品经理",
			  "电商产品经理",
			  "游戏策划",
			  "产品实习生"
			]
		  },
		  "职能": {
			"高端职位": [
			  "行政总监/经理",
			  "财务总监/经理",
			  "HRD/HRM",
			  "CFO",
			  "CEO"
			],
			"财务": [
			  "会计",
			  "出纳",
			  "财务",
			  "结算",
			  "税务",
			  "审计",
			  "风控"
			],
			"人力资源": [
			  "人事/HR",
			  "培训经理",
			  "薪资福利经理",
			  "绩效考核经理",
			  "人力资源",
			  "招聘",
			  "HRBP",
			  "员工关系"
			],
			"行政": [
			  "助理",
			  "前台",
			  "行政",
			  "总助",
			  "文秘"
			],
			"法务": [
			  "法务",
			  "律师",
			  "专利"
			]
		  },
		  "设计": {
			"交互设计": [
			  "网页交互设计师",
			  "交互设计师",
			  "无线交互设计师",
			  "硬件交互设计师"
			],
			"高端职位": [
			  "设计经理/主管",
			  "设计总监",
			  "视觉设计经理/主管",
			  "视觉设计总监",
			  "交互设计经理/主管",
			  "交互设计总监",
			  "用户研究经理/主管",
			  "用户研究总监"
			],
			"用户研究": [
			  "数据分析师",
			  "用户研究员",
			  "游戏数值策划"
			],
			"视觉设计": [
			  "网页设计师",
			  "Flash设计师",
			  "APP设计师",
			  "UI设计师",
			  "平面设计师",
			  "广告设计师",
			  "多媒体设计师",
			  "原画师",
			  "游戏特效",
			  "游戏界面设计师",
			  "视觉设计师",
			  "游戏场景",
			  "游戏角色",
			  "游戏动作"
			]
		  },
		  "金融": {
			"审计税务": [
			  "审计",
			  "法务",
			  "会计",
			  "清算"
			],
			"高端职位": [
			  "投资总监",
			  "融资总监",
			  "并购总监",
			  "风控总监",
			  "副总裁"
			],
			"投融资": [
			  "投资经理",
			  "分析师",
			  "投资助理",
			  "融资",
			  "并购",
			  "行业研究",
			  "投资者关系",
			  "资产管理",
			  "理财顾问",
			  "交易员"
			],
			"风控": [
			  "风控",
			  "资信评估",
			  "合规稽查",
			  "律师"
			]
		  },
		  "运营": {
			"客服": [
			  "售前咨询",
			  "售后客服",
			  "淘宝客服",
			  "客服经理"
			],
			"运营": [
			  "内容运营",
			  "产品运营",
			  "数据运营",
			  "用户运营",
			  "活动运营",
			  "商家运营",
			  "品类运营",
			  "游戏运营",
			  "网络推广",
			  "运营专员",
			  "网店运营",
			  "新媒体运营",
			  "海外运营",
			  "运营经理"
			],
			"高端职位": [
			  "主编",
			  "运营总监",
			  "COO",
			  "客服总监"
			],
			"编辑": [
			  "副主编",
			  "内容编辑",
			  "文案策划",
			  "记者"
			]
		  },
		  "市场与销售": {
			"公关": [
			  "媒介经理",
			  "广告协调",
			  "品牌公关"
			],
			"市场/营销": [
			  "市场策划",
			  "市场顾问",
			  "市场营销",
			  "市场推广",
			  "SEO",
			  "SEM",
			  "商务渠道",
			  "商业数据分析",
			  "活动策划",
			  "网络营销",
			  "海外市场",
			  "政府关系"
			],
			"供应链": [
			  "物流",
			  "仓储"
			],
			"销售": [
			  "销售专员",
			  "销售经理",
			  "客户代表",
			  "大客户代表",
			  "BD经理",
			  "商务渠道",
			  "渠道销售",
			  "代理商销售",
			  "销售助理",
			  "电话销售",
			  "销售顾问",
			  "商品经理"
			],
			"高端职位": [
			  "市场总监",
			  "销售总监",
			  "商务总监",
			  "CMO",
			  "公关总监",
			  "采购总监",
			  "投资总监"
			],
			"投资": [
			  "分析师",
			  "投资顾问",
			  "投资经理"
			],
			"采购": [
			  "采购专员",
			  "采购经理",
			  "商品经理"
			]
		  },
		  "技术": {
			"项目管理": [
			  "项目经理",
			  "项目助理"
			],
			"DBA": [
			  "MySQL",
			  "SQLServer",
			  "Oracle",
			  "DB2",
			  "MongoDB",
			  "ETL",
			  "Hive",
			  "数据仓库",
			  "DBA其它"
			],
			"前端开发": [
			  "web前端",
			  "Flash",
			  "html5",
			  "JavaScript",
			  "U3D",
			  "前端开发其它"
			],
			"移动开发": [
			  "HTML5",
			  "Android",
			  "iOS",
			  "WP",
			  "移动开发其它"
			],
			"后端开发": [
			  "Java",
			  "Python",
			  "PHP",
			  "C",
			  "VB",
			  "Delphi",
			  "Perl",
			  "Ruby",
			  "Hadoop",
			  "数据挖掘",
			  "自然语言处理",
			  "搜索算法",
			  "精准推荐",
			  "全栈工程师",
			  "Go",
			  "ASP",
			  "Shell",
			  "后端开发其它"
			],
			"测试": [
			  "测试",
			  "测试工程师",
			  "自动化测试",
			  "功能测试",
			  "性能测试",
			  "测试开发",
			  "游戏测试",
			  "白盒测试",
			  "灰盒测试",
			  "黑盒测试",
			  "手机测试",
			  "硬件测试",
			  "测试经理",
			  "测试其它"
			],
			"高端职位": [
			  "技术经理",
			  "技术总监",
			  "架构师",
			  "CTO",
			  "运维总监",
			  "技术合伙人",
			  "项目总监",
			  "测试总监",
			  "安全专家",
			  "高端技术职位其它"
			],
			"运维": [
			  "运维工程师",
			  "运维开发工程师",
			  "网络工程师",
			  "系统工程师",
			  "IT支持",
			  "IDC",
			  "CDN",
			  "F5",
			  "系统管理员",
			  "病毒分析",
			  "WEB安全",
			  "网络安全",
			  "系统安全",
			  "运维经理",
			  "运维其它"
			],
			"企业软件": [
			  "实施工程师",
			  "售前工程师",
			  "售后工程师",
			  "BI工程师",
			  "企业软件其它"
			],
			"硬件开发": [
			  "硬件",
			  "嵌入式",
			  "自动化",
			  "单片机",
			  "电路设计",
			  "驱动开发",
			  "系统集成",
			  "FPGA开发",
			  "DSP开发",
			  "ARM开发",
			  "PCB工艺",
			  "模具设计",
			  "热传导",
			  "材料工程师",
			  "精益工程师",
			  "射频工程师",
			  "硬件开发其它"
			]
		  }
		}
		
	para_data = {
		  "工作经验": [
			"不限",
			"应届毕业生",
			"3年及以下",
			"3-5年",
			"5-10年",
			"10年以上"
		  ],
		  "学历要求": [
			"不限",
			"大专",
			"本科",
			"硕士",
			"博士",
			"不要求"
		  ],
		  "融资阶段": [
			"不限",
			"未融资",
			"天使轮",
			"A轮",
			"B轮",
			"C轮",
			"D轮及以上",
			"上市公司",
			"不需要融资"
		  ],
		  "行业领域": [
			"不限",
			"移动互联网",
			"电子商务",
			"金融",
			"企业服务",
			"教育",
			"文化娱乐",
			"游戏",
			"O2O",
			"硬件",
			"社交网络",
			"旅游",
			"医疗健康",
			"生活服务",
			"信息安全",
			"数据服务",
			"广告营销",
			"分类信息",
			"招聘",
			"其他"
		  ],
		  "月薪": [
			"不限",
			"2k以下",
			"2k-5k",
			"5k-10k",
			"10k-15k",
			"15k-25k",
			"25k-50k",
			"50k以上"
		  ]
		}
	
	return(render(request, "index.html",{"city":json.dumps(city_data["city"], ensure_ascii=False),
										 "job":json.dumps(job_data, ensure_ascii=False),
										 "other_parameter":json.dumps(para_data, ensure_ascii=False)}))
										 
